{"meta":{"title":"幼儿园扛把子","subtitle":null,"description":"Keep your eyes on the stars and your feet on the ground.","author":"LiangTianhua","url":"http://www.liantianhua.com/myblog"},"pages":[{"title":"about","date":"2017-07-29T04:34:50.000Z","updated":"2017-07-29T04:36:11.000Z","comments":true,"path":"about/index.html","permalink":"http://www.liantianhua.com/myblog/about/index.html","excerpt":"","text":""},{"title":"categories","date":"2017-07-29T04:02:46.000Z","updated":"2017-07-29T04:05:41.000Z","comments":true,"path":"categories/index.html","permalink":"http://www.liantianhua.com/myblog/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2017-07-29T04:02:27.000Z","updated":"2017-07-29T04:04:43.000Z","comments":true,"path":"tags/index.html","permalink":"http://www.liantianhua.com/myblog/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"代码恒久远，BUG永流传","slug":"代码恒久远，BUG永流传","date":"2020-07-21T16:00:12.000Z","updated":"2020-07-21T16:34:06.547Z","comments":true,"path":"2020/07/22/代码恒久远，BUG永流传/","link":"","permalink":"http://www.liantianhua.com/myblog/2020/07/22/代码恒久远，BUG永流传/","excerpt":"北极冻土里的代码，是 GitHub 的终极浪漫。 我的小破站似乎也有幸被带到北极封存1000年……","text":"北极冻土里的代码，是 GitHub 的终极浪漫。 我的小破站似乎也有幸被带到北极封存1000年…… 在常年冰封的 Svalbard——斯瓦尔巴群岛，坐落着世界上最北端的小镇。这里气候极寒，数千只北极熊与三千人类居民共生。受国际斯瓦尔巴条约的监管，它是地球上最偏远，也是地缘政治最稳定的人类居住地之一。 在 GitHub 的一项异常浪漫的人类计划里，Svalbard 被选作存放现代人类文明火种的最佳位置。7月8日，GitHub将支撑当今社会运转的几乎所有开源代码，以胶片的形式储存，打包运往Svalbard。目前，这些胶片已经被放置在钢制容器内，密封在一个废弃煤矿中。在这个极其干燥的、-5°C恒温的矿井中，这些代码至多可以保存一千年。这是身处2020年的人类，留给未来历史学家们的礼物。在官方声明中，GitHub写到，「未来的历史学家将能够从开源项目和元数据中了解我们，他们可能会认为我们这个开源的、志愿的、遵循摩尔定律的时代具有历史意义。」 虽然 Svalbard 会受到气候变化的影响，但在可预见的未来，受到影响的大概率只是最外层几米的永久冻土，气候变暖不会威胁矿井的稳定。因此，这个矿井也成为保存人类文明的重要基地。AWA（Arctic World Archive，世界数据档案馆）就在这里，除 GitHub 的代码外，AWA 已经保存了来自意大利、巴西、挪威、梵蒂冈和许多其他国家的历史和文化数据。著名的「全球种子库」也位于此，距离 GitHub 选择的矿井仅一英里远，那里保存了世界上几乎所有农作物的种子。或许是静待末日重启，又或者是在平安顺遂的数百年后等待历史学家考古。被冰封在 Svalbard 的人类文明，无论是种子还是代码，对于未来的人类来说，都承载着像如今马丘比丘和吴哥窟一样的历史意义。计算机世界疯狂迭代，被迭代掉的代码往往惨遭丢弃，或者被放进不足够稳定的存储介质中。毫不危言耸听，若不采取行动，当下社会中的数字资料，在未来几代人的时间周期内，将会消失殆尽。GitHub 的初心来源于此。硬盘、磁带、CD、SSD，这些介质在「保存人类文明」这件事面前，都显得不足够稳定。地理位置也是考虑因素之一，战争也好，自然灾害也罢，天灾人祸时有发生。作为当下数字社会运转的基石，如何让开源代码长期、安全地被保存下来，是 GitHub 想要成就的事。 详情见：https://github.blog/2020-07-16-github-archive-program-the-journey-of-the-worlds-open-source-code-to-the-arctic/","categories":[{"name":"GIthub","slug":"GIthub","permalink":"http://www.liantianhua.com/myblog/categories/GIthub/"}],"tags":[{"name":"北极","slug":"北极","permalink":"http://www.liantianhua.com/myblog/tags/北极/"},{"name":"小破站","slug":"小破站","permalink":"http://www.liantianhua.com/myblog/tags/小破站/"},{"name":"代码","slug":"代码","permalink":"http://www.liantianhua.com/myblog/tags/代码/"}]},{"title":"雅各布·尼尔森《界面设计的十大经验法则》","slug":"雅各布·尼尔森《界面设计的十大经验法则》","date":"2020-06-30T02:10:01.000Z","updated":"2020-06-30T03:16:49.227Z","comments":true,"path":"2020/06/30/雅各布·尼尔森《界面设计的十大经验法则》/","link":"","permalink":"http://www.liantianhua.com/myblog/2020/06/30/雅各布·尼尔森《界面设计的十大经验法则》/","excerpt":"10 Usability Heuristics for User Interface Design 尼尔森用户界面设计的十大易用性启发","text":"10 Usability Heuristics for User Interface Design 尼尔森用户界面设计的十大易用性启发 ABOUTAbout Jakob NielsenJakob Nielsen holds a Ph.D. in human–computer interaction (HCI) from the Technical University of Denmark in Copenhagen.From 1994 to 1998 he was a Sun Microsystems Distinguished Engineer. Dr. Nielsen established the “discount usability engineering” movement for fast and cheap improvements of user interfaces and has invented several usability methods, including heuristic evaluation. He holds 79 United States patents, mainly on ways of making the Internet easier to use.In June 2000, Dr. Nielsen was inducted into the Scandinavian Interactive Media Hall of Fame and in April 2006, he was inducted into the ACM Computer-Human Interaction Academy. He was the 2013 recipient of the Lifetime Achievement Award for Human–Computer Interaction Practice from SIGCHI, the premiere professional society in the HCI field. About NN/G (Nielsen Norman Group)They are a UX research and consulting firm trusted by leading organizations world-wide to provide reliable guidance on user experience.Jakob Nielsen and Don Norman, are recognized around the world for their leadership in defining the field of UX. Together, they founded Nielsen Norman Group, an elite firm dedicated to improving the everyday experience of using technology. Key word:experience of using technology About 10 Usability Heuristics for User Interface DesignSummary: Jakob Nielsen’s 10 general principles for interaction design. They are called “heuristics” because they are broad rules of thumb and not specific usability guidelines.Topics: Heuristic Evaluation, Human Computer Interaction, Web UsabilityBy Jakob Nielsen on April 24, 1994 No.1_Visibility of system status The system should always keep users informed about what is going on, through appropriate feedback within reasonable time. No.2_Match between system and the real world The system should speak the users’ language, with words, phrases and concepts familiar to the user, rather than system-oriented terms. Follow real-world conventions, making information appear in a natural and logical order. No.3_User control and freedom Users often choose system functions by mistake and will need a clearly marked “emergency exit” to leave the unwanted state without having to go through an extended dialogue. Support undo and redo. No.4_Consistency and standards Users should not have to wonder whether different words, situations, or actions mean the same thing. Follow platform conventions. No.5_Error prevention Even better than good error messages is a careful design which prevents a problem from occurring in the first place. Either eliminate error-prone conditions or check for them and present users with a confirmation option before they commit to the action. No.6_Recognition rather than recall inimize the user’s memory load by making objects, actions, and options visible. The user should not have to remember information from one part of the dialogue to another. Instructions for use of the system should be visible or easily retrievable whenever appropriate. No.7_Flexibility and efficiency of use Accelerators — unseen by the novice user — may often speed up the interaction for the expert user such that the system can cater to both inexperienced and experienced users. Allow users to tailor frequent actions. No.8_Aesthetic and minimalist design Dialogues should not contain information which is irrelevant or rarely needed. Every extra unit of information in a dialogue competes with the relevant units of information and diminishes their relative visibility. No.9_Help users recognize, diagnose, and recover from errors Error messages should be expressed in plain language (no codes), precisely indicate the problem, and constructively suggest a solution. No.10_Help and documentation Even though it is better if the system can be used without documentation, it may be necessary to provide help and documentation. Any such information should be easy to search, focused on the user’s task, list concrete steps to be carried out, and not be too large. End十大启发官方讲解视频百度云链接:https://pan.baidu.com/s/1318fXmdgHZ8CvvQ4t1lHMw 密码:p1kh官文来源：https://www.nngroup.com/articles/ten-usability-heuristics/视频来源：https://www.youtube.com/user/NNgroup/playlistsNNG官网：https://www.nngroup.com/优设文章解读与案例分析：https://www.uisdc.com/?s=%E5%B0%BC%E5%B0%94%E6%A3%AE产品壹佰文章：http://www.chanpin100.com/article/109574没事的时候点一点这个个也不错：https://hao.uisdc.com/","categories":[{"name":"产品","slug":"产品","permalink":"http://www.liantianhua.com/myblog/categories/产品/"}],"tags":[{"name":"UI","slug":"UI","permalink":"http://www.liantianhua.com/myblog/tags/UI/"},{"name":"尼尔森十大易用性原则","slug":"尼尔森十大易用性原则","permalink":"http://www.liantianhua.com/myblog/tags/尼尔森十大易用性原则/"},{"name":"界面设计","slug":"界面设计","permalink":"http://www.liantianhua.com/myblog/tags/界面设计/"}]},{"title":"【周末行】-穿越惠东黑排角","slug":"【周末行】-穿越惠东黑排角","date":"2020-06-20T12:00:52.000Z","updated":"2020-06-20T12:27:10.148Z","comments":true,"path":"2020/06/20/【周末行】-穿越惠东黑排角/","link":"","permalink":"http://www.liantianhua.com/myblog/2020/06/20/【周末行】-穿越惠东黑排角/","excerpt":"上周跟灿哥说走就走，四人行。去了这个黑排角，穿了短裤，运动鞋+拖鞋，烈日，作死套装还不涂防晒。现在腿还有点辣辣的感觉，不过这地方真的合适自驾过来穿山越岭，踩踩沙滩，就是太阳太猛了，Mark一下，有机会还会再去的。","text":"上周跟灿哥说走就走，四人行。去了这个黑排角，穿了短裤，运动鞋+拖鞋，烈日，作死套装还不涂防晒。现在腿还有点辣辣的感觉，不过这地方真的合适自驾过来穿山越岭，踩踩沙滩，就是太阳太猛了，Mark一下，有机会还会再去的。 话不多说，看地方、看线路、看图，想去的就动起来吧，当减肥。","categories":[{"name":"周末行","slug":"周末行","permalink":"http://www.liantianhua.com/myblog/categories/周末行/"}],"tags":[{"name":"碧海","slug":"碧海","permalink":"http://www.liantianhua.com/myblog/tags/碧海/"},{"name":"蓝天","slug":"蓝天","permalink":"http://www.liantianhua.com/myblog/tags/蓝天/"},{"name":"黑排角","slug":"黑排角","permalink":"http://www.liantianhua.com/myblog/tags/黑排角/"},{"name":"徒步","slug":"徒步","permalink":"http://www.liantianhua.com/myblog/tags/徒步/"},{"name":"穿越","slug":"穿越","permalink":"http://www.liantianhua.com/myblog/tags/穿越/"},{"name":"周末行","slug":"周末行","permalink":"http://www.liantianhua.com/myblog/tags/周末行/"}]},{"title":"五月最后一天刷屏的四件事","slug":"KKR","date":"2020-05-31T13:47:11.000Z","updated":"2020-06-01T04:51:16.092Z","comments":true,"path":"2020/05/31/KKR/","link":"","permalink":"http://www.liantianhua.com/myblog/2020/05/31/KKR/","excerpt":"Keep your eyes on the stars and your feet on the ground. 仰望星空，脚踏实地。 Theodore Roosevelt（西奥多·罗斯福） 26th president of the United States（美国第26届总统）","text":"Keep your eyes on the stars and your feet on the ground. 仰望星空，脚踏实地。 Theodore Roosevelt（西奥多·罗斯福） 26th president of the United States（美国第26届总统） 今天2020年5月最后一天，31号，今天朋友圈刷屏了四件事。 SpaceX商用载人龙飞船发射成功，钢铁侠的火星殖民梦又近一步。北京时间5月31日凌晨3:22分，搭载着两名宇航员的SpaceX载人龙飞船，从美国佛罗里达州肯尼迪航天中心39A发射台成功发射，并成功在海上回收一级火箭。这无疑是一次具有重大意义的飞行——其是世界历史上首次由私营航天企业进行的载人发射，也是美国时隔9年首次使用国产火箭从本土将宇航员送入太空。在此之前，载人航天项目一般由政府机构负责，自2011年美国航天飞机退役以后，美国就没有了自己载人航天的飞行器，宇航员往返空间站只能完全依赖俄罗斯飞船，每个座位需要向俄罗斯缴纳近9000万美元，而SpaceX 的价格只有5000万刀左右。这是人类历史上首个商业载人航天飞船，它揭开了人类商业航天的序幕。对 Elon Musk（马斯克）来说，他那听起来无比疯狂的移民火星计划，又跨出了坚实的一步。我本来想在Youtube上看直播的，以为时间是凌晨两点，没注意看下面写的时间是3:20，朋友提醒我看的时候才注意到，怕熬夜熬不到三点半，就提十二点睡了，只能7点起来重温历史了。没别的赞词，就是牛逼二字且三连。SpaceX牛逼，人类很牛逼，这个 Tesla 和 SpaceX 这两个世界上最酷公司的双料 CEO牛逼，果然有与众不同的能量。网传Elon Musk 并不是个喜欢交际和擅长造势的商人。如他所说，他自己更像是个「有点疯狂的工程师」，不要指望他像那些熟悉公众情绪和充满语言天赋的商业精英那样去取悦和迎合别人。 可能所有世界级的辉煌背后，都需要一些执念，加上真正的独立思考吧。关于SpaceX、猎鹰9号火箭/龙飞船 驾驶教程，官方出品 不是开玩笑的媒体解析，点这里 五月天每年的五月都要唱歌给大家听为了实现和歌迷们的一个约定——每年的五月都要唱歌给大家听，5月25日，五月天乐队主唱阿信发消息称，五月天即将于5月31日20:00举办线上演唱会。刚刚的时候，我的朋友圈内感慨万千。真的的被刷频了，可能压抑三个月的情绪，需要一场演唱会来提升情绪，整理心情，重新出发吧，一切都慢慢变好会好。 美帝暴乱危机，内部大乱斗。“佛洛伊德之死”引发的骚乱，宵禁令下，美国多地暴力不断，大规模集会烧抢。看看油管的搜索和推特的趋势榜，还是感慨和平安乐的我国挺好的。对了，周六的时候川建国在白宫新闻发布会上宣布，美国将退出世界卫生组织，理由是世卫组织未能完成美国要求的改革。同时还要真的香港作出制裁，取消关税优惠政策。周六晚上正好看了一个纪录片《美国鸿沟-从奥巴马到特朗普》，才知道美帝内部的竞争以及种族歧视问题，原来十年前奥巴马和特朗普十年前就斗上了，真神奇啊。 刷屏的KKR经济投研报告《Phase II: The Next Chapter》 KKR集团（Kohlberg Kravis Roberts &amp; Co. L.P.，简称KKR），中文译名为“科尔伯格·克拉维斯” ，是老牌的杠杆收购天王，金融史上最成功的产业投资机构之一 ，全球历史最悠久也是经验最为丰富的私募股权投资机构之一。 吃完饭的时候，看到群里有大佬分享了一片KKR的分析报告，《Phase II: The Next Chapter》（我看的是中文译版，百度就可以看到），看了一个小时多。整理了一些摘要学习、记录一下。原版点这里web或者PDF。1.疫情影响了原有的生活方式，再次点亮了社会的不平等性，中国的网上信贷违约率大幅提高，努力存钱应对类似的危机吧。 2.未来几个季度出现持续的去杠杆周期，去企业的高杠杆，应该会有不少的企业承压并破产。二战后美国企业的平均税率是42%，今天只有21%。疫情带来的失业率持续攀升，再就业要重新配许以适应行业变化，对低学历人群冲击最大。企业效益不好，商业和住宅REITS承压。 3.抢反弹的可以吃瓜围观了，在政府的干扰下市场修复得很快。没怎么反弹的，抄底也要很慎重了，这种底不是传统认知的那种底。并不建议抄底金融和传统消费股，因为疲弱的复工可能压制利润以及带来违约和拖欠现象的攀升。本次疫情直接刺激了数字经济出现大规模增长，大量的行业会转向互联网化，加速数字革命，（云计算、医疗、新零售、在线教育等），特别是优质科技股。“宅经济”的互联网应用流量大幅提高，韧性更强。目前处于二阶段震荡、调整、重组周期，疫苗出来之前实在想抓住机会投资的话，可以选择疫情受益的行业或者资金面良好的优质企业。 4.标普500可能对经济基本面失真了，罗素2000（RTYmian）可能更真实一点。对于周期价投的玩家，KKR认为标普500会2022年在3300点左右（也就是在2020年年初疫情没爆发前的盈利预测），所以这个经济基本面调整周期大概要持续1.5-2年。目前标普500缺乏基本面支撑的上行动力。此次反弹大概率会有回调，因为市场已经到了合理价值。从历史数据来看，美股有75%的概率会二次下探。（过去的16次反弹中，有12次经历了二次下探）。 5.KKR认为传统的资产配置模式要发生改变，借鉴日本80年代末-90年代初的历史经验，传统资产长期低收益率可能就是未来的宿命，信用债收益可能比股票的股息更好。 6.这次疫情全球会有更多更大的刺激、更多的央行干预来临，所以不要更央行对着干，有更多的刺激计划意味着现在的情况不容乐观。经济恢复没这么快，还要时刻警惕燥动的地缘政治因素。 7.对需求的担忧加剧，GDP将会趋势性恶化。美国虽然看到了希望，但是经济大部分依然处于停摆状态。对于不部分发展中国家的国债，违约率要到债务占GDP比重150%后，开始大幅上升，大部分国家的债务问题都在朝这个方向发展。对于短期内通缩的担忧日益增强。中国这边对经济似乎要重新启动并有好转的迹象，但是全球来看未来几个月的经济持续增长能力可能会让我们有些许失望。 KKR寄语：勇于开拓，走鲜有人走的路。保持谦卑与热忱，大家共克时艰。脚踏实地，仰望星空。","categories":[{"name":"杂谈","slug":"杂谈","permalink":"http://www.liantianhua.com/myblog/categories/杂谈/"}],"tags":[{"name":"SpaceX","slug":"SpaceX","permalink":"http://www.liantianhua.com/myblog/tags/SpaceX/"},{"name":"五月天","slug":"五月天","permalink":"http://www.liantianhua.com/myblog/tags/五月天/"},{"name":"美帝的UNREST","slug":"美帝的UNREST","permalink":"http://www.liantianhua.com/myblog/tags/美帝的UNREST/"},{"name":"疫情","slug":"疫情","permalink":"http://www.liantianhua.com/myblog/tags/疫情/"},{"name":"KKR","slug":"KKR","permalink":"http://www.liantianhua.com/myblog/tags/KKR/"},{"name":"经济基本面","slug":"经济基本面","permalink":"http://www.liantianhua.com/myblog/tags/经济基本面/"}]},{"title":"原油期货与美股期权","slug":"原油期货与美股期权","date":"2020-04-21T08:01:45.000Z","updated":"2020-04-23T13:57:59.040Z","comments":true,"path":"2020/04/21/原油期货与美股期权/","link":"","permalink":"http://www.liantianhua.com/myblog/2020/04/21/原油期货与美股期权/","excerpt":"今天早上起来又看到大新闻了，周二早间美国原油WTI出现诡异暴跌，美原油5月期货合约跌至负值，收盘最低触及-40.32美元/桶，这是自1946年二战结束美国历史上有原油交易数据以来最没底线的一次触底，5月美油期货结算价为-37.63美元/桶，下跌55.9美元/桶；跌幅高达305.97%，巴菲特都没见过的三、四月份。上周末我研究了一下美股的期权，正好今天这个原油的大新闻，一起写下来记录一下。","text":"今天早上起来又看到大新闻了，周二早间美国原油WTI出现诡异暴跌，美原油5月期货合约跌至负值，收盘最低触及-40.32美元/桶，这是自1946年二战结束美国历史上有原油交易数据以来最没底线的一次触底，5月美油期货结算价为-37.63美元/桶，下跌55.9美元/桶；跌幅高达305.97%，巴菲特都没见过的三、四月份。上周末我研究了一下美股的期权，正好今天这个原油的大新闻，一起写下来记录一下。 西德州轻质原油期货-WTI2005暴跌石油期货就是以远期石油价格为标的物品的期货，是期货交易中的一个交易品种。由期货交易所统一制定，以原油为标的的标准化合约，其中很出名的有美油和布油。基于WTI原油报价,合约标志:CL,期货场所:纽约商品交易所（NYMEX）。 为什么会出现周一的暴跌，还出现了负值？0.各种猜测画了个图，如下：首先是一周前芝加哥大宗商品交易所修改了规则，允许了负价格交易。在交易规则上来说，如果在交割来临前的最后时刻（特别是影响交割价格确认的那三分钟），存在严重的流动性问题的话，卖家急于卖出合约，那买家看到机会，认为把买方的价格挂在-40美元，因为要卖方要匹配卖方的价格，卖房的合约是个毒合约必须要卖出，所以这个时刻是买方市场（主动权），所以最后达成了-40美元的价格。这其中有几个要素，分布是负价格规则的修改，芝商所交割价格的定义，交割时间，流动性挤兑。交易员可以通过这种方式，谋取暴利。 1.关于中国银行原油包的亏损（据说） 如果中行是做市商的话，应该只是挣个2块钱一桶的手续费而已。可能是tas指令（具体的可以百度这个指令对应的交割协议）的原因，导致最后的交割价格是最后的负数。核心原因还是风险控制没做好，产品设计有问题。如果中行是私下自己做多空对手盘的话，那这其中就有太多的玩意可以扯皮了。最大化薅客户的利益？结果玩砸了，没想到有负价格。史上第一次的负价格，刷新了很多经济学家、基金经理、交易员、小散户的新世界。 这个大瓜，把油价砸到-40美金的竟然是中国银行，一把亏了中行客户300多亿。其他原油机构都提前调仓换月了，比如工行建行，美股的uso，上周都换完了，不知道为什么中行一直没换，拖到倒数第二天了才换。一般投机交易的都会提前换，拖到最后的都是打算做实物交割的机构。中行没有交割石油的能力，却一直拖到最后，这操作就很迷，最后迫不得已开始盘中砸盘。昨天大家伙都还在吃瓜，说怎么油价跌到-40美金，没想到亏的是中国人的钱。投资中行纸原油的客户不但本金亏完，还欠银行一倍多的本金。网上有一张持仓图，这人本金差不多400万，亏了900多万，还要给银行补500多万。 2.要知道的一个概念是“近期期货”，比如说5月的WTI期货。和“远期期货”，比如说6月的WTI期货。通常来说，期货价格要高于现货价格，远期期货价格要高于近期期货价格，因为期货市场存在持仓费用，也就是时间价值的体现，美股期权里也存在时间价值，能让期权合约价值归零的时间价值。 3.很多交易员买原油期货并不想真正的买到原油，只有炼油厂还有航空公司等实体企业会有真正需求，而华尔街只是想从差价中获利而已。正常情况下，一个月前后的近期和远期原油期货的价差在40-50美分左右。因此，如果一个合同到期而交易员们想持续做多油价，那么通常的做法是“移仓”，也就是卖掉近期期货同时买入远期期货，持续看多。转期升水损耗这个问题，在美股的石油基金中也存在，特别是短期的美国原油基金USO以及类似的UCO等，这些一般来说适合短期投机不适合长期持有。USL的话是近12个月的，这个升水损耗没这么严重。 4.没地方存放了，目前市场对5月的原油价格非常悲观，但认为6月会反弹，于是我们看到5月WTI的价格重挫，但6月WTI的价格仍然还在20美元每桶附近交易。这就将交易员们逼到了一个死胡同：如果不移仓，每手1000桶的原油实物必须要找地方储存。且不说现在全球存储空间快到达极限，就算可以找到地方储存，费用也会高到非常不划算。那如果移仓到6月的期货呢，现在6月期货价格在20美元之上，而5月期货价格在负值，这样创下历史新高的价差导致的亏损使得没人会去移仓。那怎么办呢，随着交割日期只剩一天，留给华尔街的似乎就只有一条路了：卖！无论是什么价格，都要平仓。因此我们看到WTI油价的迅速断崖式地跳水下挫，不断刷新历史新低纪录。 美股期权(Options) 股票期权是一种金融衍生产品，赋予投资者在约定的日期前以约定的价格买卖指定股票的权利。(权利并非义务，期权在行权日之前也可以进行期权合约买卖交易，如果不交易又不行权，则损失权益金。)主要分为美式期权和欧式期权，这玩意本来是用来做保险的，后来更多的人把它当作一种巨大杠杆的投机工具，就是那种要么0要百分之几百，投机性极强。这玩意几本书估计都说不完，挺复杂的，整理思路的时候我都是用Xmind去画思维导图整理的。实践一下如果亏损，那就是实打实的交学费了啊哈哈哈哈。要素1-到期日： 每个期权合约都有一个设定的到期日。 这个日期很大程度上取决于合约本身的价值，因为它设定了您可以选择买入、卖出或行权的时间范围。 一旦期权合约到期，合约本身的价值就将归零。 要素2-行权价： 期权合约的行权价是期权约定期权买方有权利以该价格从期权卖方买入或卖出给期权卖方相应股票。 要素3-权益金： 作为买入方，您可以将权益金视为购买期权的价格。 如果您在到期前买入或卖出期权，则权益金就是它交易的价格。您可以像交易股票一样在市场上交易期权。权益金并非设定，因为期权合约价值和对应股票相关联：标的股票的价值，标的股票的波动性以及到期前剩余的时间都会影响期权的权益金。 其中，call是看涨期权（合约名称会带C），put是看跌期权（合约名称会带P），两种期权又分别对应了long和short的两种操作，即买入和卖出两种操作。然后这四个因素加起来，可以组合好多操作策略。 大部分的美股除了有正股之外，还有期权。雅虎财经主要是看下面的合约内容，圈起来的，很重要的信息,涉及到call还是put,执行价格，到期日，ask等等等 希腊字母表那天下午尝试去找一个来模拟并可视化，折腾了一会发现数学知识不够用了，后面再找个时间专门手撕一下，这玩意要理解熟悉起来估计要花不少时间，大概的内容跟下面的息息相关。 三月的深圳房价前几天看到好多朋友圈发深圳3月火爆的房价，还有什么深圳在做空自己的之类的文章，好奇背后的逻辑，就自己想，然后去查，去翻到了几条比较有意思的，整理如下： 1.短期深圳西部3月这波行情，有人提出这样的逻辑。源于这个《深圳市应对新型冠状病毒肺炎疫情中小微企业贷款贴息项目实施办法》文件。通过企业房产抵押的方式，企业可以获得国家50%+深圳50%（大概就是很低很低的利息）贴息贷款，补贴6个月。具体的做法是，企业主全款买套房，再通过企业过账抵押的形式，就可以无息贷出相当于房子估值的7成金额（新增贷款可以享受政府贴息）。这个政策以企业为主体，但必须以房产为抵押，所以好多企业主都去买房子。房子到手，贷款也到手，到手的贷款可能拿去经营企业了，也有可能继续留回楼市，同时也参杂着一些游走在边缘的行为。具体到底有没有这个，可以问问银行信贷的同学。结果，晚上好像真出事了。震惊 2.长期的，有人提出了这样的逻辑。从政府的角度来讲，首先严控土地，放宽购房政策，做高土地和房地产价格，再层层加杠杆把房地产证券化，从而做高整个城市的金融价值。然后利用市场制造暂时可控的高价值，通过再抵押为实体投资、贸易融资、科技创投提供了资金便利，从而达到产业升级，然后把杠杆加到可控的极致，让整个市场狂欢化。然后就有了张五常说的：深圳将超过上海和硅谷，成为整个地球的经济中心。通过深圳的高估值，再去撬动带高周边城市的金融价值。 3.影响的可能还有货币供应的三兄弟——M0、M1、M2，降准降息印钞放水。至于这些大佬为啥瞄准深圳，可能是深圳确实有过人的魅力，得天独厚的条件。也有可能是不流动起来的钱不算热钱，热钱毫无疑问是去热闹的地方，所以首选龙头标的-宇宙中心深圳啊哈哈哈哈。","categories":[{"name":"期货与期权","slug":"期货与期权","permalink":"http://www.liantianhua.com/myblog/categories/期货与期权/"}],"tags":[{"name":"石油","slug":"石油","permalink":"http://www.liantianhua.com/myblog/tags/石油/"},{"name":"美股","slug":"美股","permalink":"http://www.liantianhua.com/myblog/tags/美股/"},{"name":"期货","slug":"期货","permalink":"http://www.liantianhua.com/myblog/tags/期货/"},{"name":"期权","slug":"期权","permalink":"http://www.liantianhua.com/myblog/tags/期权/"}]},{"title":"Google Material Design","slug":"Google Material Design","date":"2020-03-26T15:30:35.000Z","updated":"2020-03-28T07:54:27.379Z","comments":true,"path":"2020/03/26/Google Material Design/","link":"","permalink":"http://www.liantianhua.com/myblog/2020/03/26/Google Material Design/","excerpt":"好几年之前有在Google I/O 大会相关的视频中看到过material design这个东西，今天又在YouTube中看到了，就重新看了一些，找了一些Google官方的文档尝试去简单了解一下。似乎国内很多很多的厂商的app不那么喜欢MD的设计风格，具体的原因还有待去仔细研究，这里不做优劣评述，仅仅简单了解一下。","text":"好几年之前有在Google I/O 大会相关的视频中看到过material design这个东西，今天又在YouTube中看到了，就重新看了一些，找了一些Google官方的文档尝试去简单了解一下。似乎国内很多很多的厂商的app不那么喜欢MD的设计风格，具体的原因还有待去仔细研究，这里不做优劣评述，仅仅简单了解一下。 Google原生全家桶一个周末的时间，连续12H+12H的时间，应该等体验一遍下面几十个应用了,挺多的，先把Google play的链接Mark一下先。先不说应用内部，就从这icon就可以看出满满快要溢出屏幕的Google的感觉，就是内味了（material design）。要是体验之后，还可以去油管（YouTube）搜索相关产品视频，看下这些产品设计决策背后的一系列的逻辑，学习他们思考的过程和决策的原因，或许会给自己有一些灵感。这图有点长，但是还是想贴上来感受下内味…… Material Design Basics关于质感设计，官方是这样介绍的，如下： Material Design is a visual language that synthesizes the classic principles of good design with the innovation of technology and science. MD核心的几个PrinciplesMaterial is the metaphor Material Design is inspired by the physical world and its textures, including how they reflect light and cast shadows. Material surfaces reimagine the mediums of paper and ink. 大概的意思就是:艺术源于生活，又要高于生活，但是又不能脱离生活。有点像我们初高中学的唐诗宋词，是不是有一个类似拟物或者拟人的概念？姑且就叫它拟物吧 Bold, graphic, intentional Material Design is guided by print design methods — typography, grids, space, scale, color, and imagery — to create hierarchy, meaning, and focus that immerse viewers in the experience. 大概的意思就是：字体、版式，网格，空间，比例，颜色和图像等不仅仅是直观的界面展示，还要是简单且有意义的表达清楚所传达的信息架构、内容意义，最关键的是能帮助用户聚焦，说人话就是很容易自在的沉浸其中。太难了啊哈哈哈哈哈 Motion provides meaning Motion focuses attention and maintains continuity, through subtle feedback and coherent transitions. As elements appear on screen, they transform and reorganize the environment, with interactions generating new transformations. 大概的意思就是：有意义的动效，一定是有意义有逻辑的。通过动效微妙的反馈和连贯的过渡来吸引注意力并保持连续性。当元素出现在屏幕上时，它们将转换并重新组织环境，而交互会产生新的转换。说人话就是追求自然流畅的交互动效，完整极致的用户体验。这也很难啊哈哈哈哈，精髓。我在官方的油管视频中看到那些弧形动效的逻辑，确实是有这么点逻辑和感觉。 关于动画效果这块，官方还有四个小玩意要说明的。 Authentic Motion动效的价值容易理解。不是要酷酷炫炫的，是要看到物体的移动就容易懂得怎么去使用它，并能了解它的各种形态，能给用户体验带来真实价值。 Responsive Interaction动效是有逻辑的，用户会开心。动效不应该是随机发生、没有意义的。 Meaningful Transitions有意义的动效，带领用户的注意力去理解流程。比如滑块，滑块有弹性但是不能滑走，用户就明白这个状态下是不能滑动的。如果没有弹性，用户可能以为死机了或者卡了，这样体验就不是很好。 Delightful Details动效细节可以让用户惊喜。小细节也有小惊喜。 Flexible foundation The Material Design system is designed to enable brand expression. It’s integrated with a custom code base that allows the seamless implementation of components, plug-ins, and design elements. 大概的意思就是说，要有挺强的延续性和可扩展性。MD设计系统旨在实现品牌表达，它与自定义代码库集成在一起，可以无缝实现组件，插件和设计元素。所以就有很多可以资源库和插件库，有很多开发者、设计师支持，形成一个派系这种感觉。比如Flutter是谷歌的移动UI框架 Cross-platform Material Design maintains the same UI across platforms, using shared components across Android, iOS, Flutter, and the web. 大概的意思就是说：跨平台性，一次开发，多平台适配。这样能降低设计成本，降低开发成本，在跨平台上也能提供统一的原滋原味的流畅体验。这确实是一个大的方向，形成一个生态，现在这么多设备，手机、pc、pad、手表、汽车、家庭娱乐等等，万物互联的时代体验也要万物互联。说到这个，越来越多的厂商开始做跨设备了，Apple、Microsoft、Google、华为、小米等，都在建立自己的生态。所以跨平台是必要考虑因素。 Goals关于goals，官方如是说： Create Create a visual language that synthesizes the classic principles of good design with the innovation and possibility of technology and science.将优秀设计的经典原理与技术科学的创新尽可能性相结合，创建一种新的视觉语言。 Unify Develop a single underlying system that unifies the user experience across platforms, devices, and input methods.以统一跨平台，设备和输入理念的用户体验，开发一个基础系统。 Customize Expand Material’s visual language and provide a flexible foundation for innovation and brand expression.扩展Material的视觉语言，并为创新和品牌表达提供灵活的基础。 借大学老师卫博士的一句话总结： 要做对人类有长远意义的事，这才叫使命。 End粗浅了解一下，这些文档和视频后面等花不少时间和精力去慢慢研究，先存下来先。 官方的链接，官方的就是精髓，万变不离其中，存档。1.Android开发者官网-设计和质量2.Google Material Design Guidance and Code3.Google Design - YouTube视频合集 后面估计还会去看看Apple与Microsoft等的规范，看看有何不可不同之处。","categories":[{"name":"Material Design","slug":"Material-Design","permalink":"http://www.liantianhua.com/myblog/categories/Material-Design/"}],"tags":[{"name":"Google","slug":"Google","permalink":"http://www.liantianhua.com/myblog/tags/Google/"},{"name":"质感设计","slug":"质感设计","permalink":"http://www.liantianhua.com/myblog/tags/质感设计/"},{"name":"杂谈","slug":"杂谈","permalink":"http://www.liantianhua.com/myblog/tags/杂谈/"}]},{"title":"见证历史的黑色星期一","slug":"见证历史的黑色星期一","date":"2020-03-10T08:01:35.000Z","updated":"2020-03-11T09:20:42.309Z","comments":true,"path":"2020/03/10/见证历史的黑色星期一/","link":"","permalink":"http://www.liantianhua.com/myblog/2020/03/10/见证历史的黑色星期一/","excerpt":"昨天（2020年3月9日）真的是有趣，这一天的关键词是疫情全球扩散、石油价格战、股市熔断机制。上到金融圈精英人士，下到像我们这种普通老百姓，朋友圈都是绿油油的截图，颇有点全民吃瓜的感觉。有的见证历史很震惊，有的亏着真金白银很伤心，还有的真是吃瓜群众。我记得去年有一次在公司吃饭，我们同事间聊到有没有机会见证一下熔断机制触发的可能，没想到真的看到了，就在昨天……","text":"昨天（2020年3月9日）真的是有趣，这一天的关键词是疫情全球扩散、石油价格战、股市熔断机制。上到金融圈精英人士，下到像我们这种普通老百姓，朋友圈都是绿油油的截图，颇有点全民吃瓜的感觉。有的见证历史很震惊，有的亏着真金白银很伤心，还有的真是吃瓜群众。我记得去年有一次在公司吃饭，我们同事间聊到有没有机会见证一下熔断机制触发的可能，没想到真的看到了，就在昨天…… 看图说故事全球市场经历了“黑色星期一”，A股跌幅超过3%，欧洲四强英法德意跌幅近%，美帝跌幅7%触发熔断，市场一片哀嚎。不过这些跟石油相比，已经算很温柔。原油期货价格最高暴跌超过30%，WTI原油最低跌到了27美元一桶。什么概念呢，30美元以下在过去20年都算是大甩卖价。有人做了一幅图，对比了一下同等体积的石油和矿泉水。不要面子的原油，竟然如下‘不要脸’。 据说原因是以沙特为首的欧佩克成员跟俄罗斯谈崩了，沙特要掀翻桌子，增产，打价格战。 沙特：不谈了，老子不陪你们玩了，我要增产，我要降价。俄罗斯：你尽管打，信不信，老子撑10年眼都不眨的！美帝：哥俩，别乱搞事行不？？我的页岩油成本这么高，唱双簧害死我？中国：我天朝作为石油进口国，做梦都会笑醒，你们尽管降价，有多少收多少，正好2020要搞新基建。 当然了，30刀这个价格不可能是长期的，有机会可以趁机抄底一下油气相关的基金，放个1-2年，或许收益还是可以跑赢通胀。如果对石油、战争、中东问题感兴趣的，先Mark一下局座的科普视频，如下。 1.《局座说车》第13期:油气相关 2.《局座说车》第14期:油价看涨还是看跌 3.《局座说车》第15期:石油与战争 说回熔断机制股市熔断机制是一种金融监管工具，是用来防止股票市场崩溃发生。熔断机制的目的是为了防止在短时间内出现过度投机性的收益和戏剧性的损失。熔断机制被触发后，要么在短时间内停止交易，要么提前结束交易，以便让做市商之间传递准确的信息，让机构交易者评估自己的头寸，做出理性的决定。故事开始在1987年10月19日，纽约股票市场爆发了史上最大的崩盘事件，道琼斯工业指数下跌22.6%，史称“黑色星期一”。为了降低此类风险，次年，也就是1988年，美国商品期货交易委员会与证券交易委员会批准纽约股票交易所和芝加哥商业交易所的熔断机制。目前美国指数熔断机制的基准指数为标普500，单项跌幅阈值为7%、13%、20%。也就是说当指数较前一天收盘点位下跌7%、13%时，全美证券市场交易将暂停15分钟，当指数较前一天收盘点位下跌20%时，当天交易停止。指数熔断三级机制如下： 2010年美股又开始实行个股熔断机制，个股的有特别细节的要求，跟指数不一样。如下： 熔断机制也对芝加哥商品交易所(CME)和所有附属交易所生效，这些交易所对股指期货交易的门槛与纽约证交所相同。然而，有一个CME特定的价格限制，防止5%的上涨和下跌的价格在盘后的交易。采用百分比阈值的基准价格来自于前一个交易日最后30秒内的未来加权平均价格。股指期货和外汇期货的价格限制在每个交易日结束时公布在芝加哥商品交易所的网站上。 初衷1987年10月19日股市崩盘后，美国总统罗纳德•里根(Ronald Reagan)组建了一个名为布雷迪委员会(Brady Commission)的市场机制特别工作组，调查股市崩盘的原因。布雷迪委员会(Brady Commission)的报告有四个主要发现，其中一个指出，无论选择哪家监管机构来监管股市，都应该负责设计和实施被称为“熔断机制”(circuit breakers)的价格限制系统。熔断机制的初衷并不是为了防止剧烈但公平的价格波动，而是为了让交易员和专家有足够的时间进行充分沟通。在30多年前的那次“黑色星期一”当天，股市暴跌的原因是市场信息流通不畅，以及不同市场之间缺乏统一的融资融券交易规则使用。 案例1997年10月27日，根据当时生效的交易限制规定，在道琼斯工业股票平均价格指数下跌550点后，纽约证券交易所提前停止交易。这是美国股市首次因交易限制而提前收盘。从那以后，熔断机制从道琼斯工业股票平均价格指数(Dow Jones Industrial Average point -based system)的点位制度演变成了追踪标准普尔500指数(S&amp;P 500)的百分比变动制度。2020年3月9日，由于对冠状病毒(Covid19)和油价下跌的担忧，标准普尔500指数下跌了7.79%(2,013点)，迫使市场关闭了15分钟。 目前在美国交易时段和非美国交易时段，都有熔断机制。在美国交易时段内，只对下跌有熔断机制。如下图 而非美国交易时段的期货有针对上涨和下跌的熔断机制。如下图 熔断机制的负面效性尽管断路器背后的目的是停止交易,交易商可以花点时间去思考和消化新信息,有很多实际情况显示成交量随价格水平接近熔断水平上升,这反而为更不稳定的市场环境奠定了基础。 磁铁效应：这一理论认为，市场水平越接近熔断阀值，情况就会越严重，因为交易员担心一旦市场停止交易，他们就会因为担心自己会被套现而抛售股票。熔断机制存在偏见，因为所有大型银行、对冲基金，甚至一些养老基金都在纽约证交所指定了场内交易员，他们可以在市场对普通投资者关闭时继续交易。 随着时间的推移，这种观点变得不那么重要了，因为场内交易员的使用越来越少，大部分交易都是通过电脑生成的算法完成的与股票相关的价格发现是这样一个过程，在这个过程中，股票的市场价值是由买卖双方就一个合适的价格达成一致来决定的。由于每天都有大量的交易发生，经验丰富的交易员和使用算法交易的计算机根据最轻微的价格涨跌和买卖价差的细微变化进行交易。当交易暂停一段时间后，由于缺乏市场活动，信息流会减少，从而导致比正常买卖价差更大，从而减慢“价格发现”过程。熔断机制在市场迅速下跌的时候起到了价格减速下滑的作用。它们有助于恢复平静，甚至可以建立市场信心。主要关心的是如何设置阈值:太宽,他们可能永远不会被使用,太窄,波动性会剧烈增加。但很少提供证据表明交易恢复后恐慌性抛售会减少。反对者表示，这种中断干扰了有效定价。他们还指出了一些缺陷，即 “磁石效应”，即当价格接近其边界时，交易员会“故意”推动交易触发停止。就连持怀疑态度的人也认为，熔断机制所导致的错误交易有可能让市场陷入混乱，尤其是在电脑交易激增的情况下。在实际操作中，这些措施几乎无法阻止令人难以忍受的下跌。 其他国家股市的熔断规则中国我们有涨停板跌停板。 2015年12月4日，经有关部门统一，证监会正式发布指数熔断相关规定，并将于2016年1月1日起正式实施。2016年1月4日，A股遇到史上首次“熔断”。早盘，两市双双低开，随后沪指一度跳水大跌，跌破3500点与3400点，各大板块纷纷下挫。午后，沪深300指数在开盘之后继续下跌，并于13点13分超过5%，引发熔断，三家交易所暂停交易15分钟，恢复交易之后，沪深300指数继续下跌，并于13点34分触及7%的关口，三个交易所暂停交易至收市。2016年1月7日，早盘9点42分，沪深300指数跌幅扩大至5%，再度触发熔断线，两市将在9点57分恢复交易。开盘后，仅3分钟，沪深300指数再度快速探底，最大跌幅7.21%，二度熔断触及阈值。这是2016年以来的第二次提前收盘，同时也创造了休市最快记录。2016年1月7日晚间，上海证券交易所、深圳证券交易所、中国金融期货交易所发布通知，为维护市场稳定运行，经证监会同意，自1月8日起暂停实施指数熔断机制。 英国在英国，当富时100指数成分股涨跌超过动态参考价格3%或者静态参考价格8%，则实行5分钟集合竞价，即“自动终止执行期” 。 韩国在韩国，如果KOSPI指数较前一天收盘价下跌10%或10%以上，并且这种下跌持续一分钟，则股票交易暂停十分钟，个股涨跌幅限制为15%。该机制每天只实施一次，在下午2∶20以后不再实施。 日本日本的东京证券交易所于1994年2月引入熔断机制，当股价波动超过一定幅度时，将停止交易10分钟。其熔断阈值是根据不同的基准股价设定不同的熔断阈值。例如当基准股价在100-200日元之间时，股价上下浮动超过50日元，即触发熔断；当基准股价在15000-20000日元之间，股价上下浮动超过4000日元，才触发熔断。 新加坡新加坡交易所于2014年2月开始实行熔断机制，该机制适用于约占新加坡股市交易量80%的证券，包括STI指数和摩根士丹利新加坡指数的成分股。","categories":[{"name":"金融证券","slug":"金融证券","permalink":"http://www.liantianhua.com/myblog/categories/金融证券/"}],"tags":[{"name":"石油","slug":"石油","permalink":"http://www.liantianhua.com/myblog/tags/石油/"},{"name":"熔断机制","slug":"熔断机制","permalink":"http://www.liantianhua.com/myblog/tags/熔断机制/"},{"name":"黑色星期一","slug":"黑色星期一","permalink":"http://www.liantianhua.com/myblog/tags/黑色星期一/"}]},{"title":"今天是个好日子-20200202","slug":"今天是个好日子-20200202","date":"2020-02-02T15:33:09.000Z","updated":"2020-02-03T11:56:38.749Z","comments":true,"path":"2020/02/02/今天是个好日子-20200202/","link":"","permalink":"http://www.liantianhua.com/myblog/2020/02/02/今天是个好日子-20200202/","excerpt":"看微博上说今天这个日子还是好几十年一遇的好日子，很多人原本计划今天去领证结婚的，因为疫情的影响，很多计划都赶不上变化。","text":"看微博上说今天这个日子还是好几十年一遇的好日子，很多人原本计划今天去领证结婚的，因为疫情的影响，很多计划都赶不上变化。 今天应该脱欧了，但是有一年的缓冲期。火神山医院交付军方了。明天沪深两市年后第一天，注定是血亏的一天了，大盘大概率会暴跌6个点左右，资本市场不是社会主义，倾巢之下焉有完卵，所以短期能逃就逃吧，踩踏之后再捡起来误杀的做中长期还是可以的吧。 今年看了几期《中央广播电视总台2019主持人大赛》，特别是新闻组总决赛的时候，感觉自己过去几十年的书白读了。这个节目真的合适宅在家不出门，一家人一起看，成年人看故事学应变能力，初中高中生看故事补充作文素材，挺不错的。因为这个节目，跟一帮朋友在群里讨论起了上初中时候的作文，还有鲁迅。一个朋友是老师，她说现在的孩子都不想听鲁迅了…… 鲁迅：我没说过这样的话……","categories":[{"name":"随笔","slug":"随笔","permalink":"http://www.liantianhua.com/myblog/categories/随笔/"}],"tags":[{"name":"闲聊","slug":"闲聊","permalink":"http://www.liantianhua.com/myblog/tags/闲聊/"},{"name":"20200202","slug":"20200202","permalink":"http://www.liantianhua.com/myblog/tags/20200202/"}]},{"title":"今日份随笔-20200131","slug":"今日份随笔-20200131","date":"2020-01-31T11:57:12.000Z","updated":"2020-02-02T16:03:24.940Z","comments":true,"path":"2020/01/31/今日份随笔-20200131/","link":"","permalink":"http://www.liantianhua.com/myblog/2020/01/31/今日份随笔-20200131/","excerpt":"今年这个春节，很多年后大家一定会印象深刻，你可能记不得别的春节，回想这个春节，一定会记得肺炎、封城、好长的春节假期、不出门的春节假期、湖北武汉、钟南山院士、李兰娟院士、口罩卖没了等等……","text":"今年这个春节，很多年后大家一定会印象深刻，你可能记不得别的春节，回想这个春节，一定会记得肺炎、封城、好长的春节假期、不出门的春节假期、湖北武汉、钟南山院士、李兰娟院士、口罩卖没了等等…… 春节今年这个春节最大的感触就是珍惜眼前的身边人，因为肺炎疫情的爆发，大环境的意外。科比的突然离世，世事无常。现在特别喜欢的一个词，平安喜乐。今年春节特别宅，没有了探亲活动，没有了好友聚会，时间就多了不少，跟父母交流的机会也多了很多，今年在医院工作的妹妹一如既往的因为工作关系春节没有假期，少了个话痨参与。年前整理放假的时候，发现好多初中、高中的小卡片，浔高的饭卡、水卡、贺卡、明信片，留着到几十年后当宝贝咯。 生日今天又是一年生日时，祝家人、好朋友和自己岁岁常欢愉、平安喜乐。突然想干个有意思的事…… 10天后做完，再更新。","categories":[{"name":"随笔","slug":"随笔","permalink":"http://www.liantianhua.com/myblog/categories/随笔/"}],"tags":[{"name":"疫情","slug":"疫情","permalink":"http://www.liantianhua.com/myblog/tags/疫情/"},{"name":"年","slug":"年","permalink":"http://www.liantianhua.com/myblog/tags/年/"},{"name":"闲聊","slug":"闲聊","permalink":"http://www.liantianhua.com/myblog/tags/闲聊/"}]},{"title":"2020微信公开课PRO","slug":"2020微信公开课PRO","date":"2020-01-09T13:57:08.000Z","updated":"2020-01-09T15:30:20.423Z","comments":true,"path":"2020/01/09/2020微信公开课PRO/","link":"","permalink":"http://www.liantianhua.com/myblog/2020/01/09/2020微信公开课PRO/","excerpt":"今年的主题是“未完成AIways beta”，跟以往不同的是，今年大领导故意缺席，交给中层各PM去开课，挺好，言归正传。 今天早上的时候，Wind客户端推送了一条消息震动了一下，“张小龙缺席的2020微信公开课Pro……直播中”，然后我就去腾讯视频直播间看了一上午，在线人数大概15W左右。看图（如下）大概能知道微信在过去一年和未来一定的时间做过和要做的事。聚焦微信生态的商业化能力，小程序、微信支付、小游戏、企业微信、微信公众平台、微信AI等生态产品晒出了过去一年的“成绩单”。听张小龙的话，后面可能要搞短内容，要搞带货吗？","text":"今年的主题是“未完成AIways beta”，跟以往不同的是，今年大领导故意缺席，交给中层各PM去开课，挺好，言归正传。 今天早上的时候，Wind客户端推送了一条消息震动了一下，“张小龙缺席的2020微信公开课Pro……直播中”，然后我就去腾讯视频直播间看了一上午，在线人数大概15W左右。看图（如下）大概能知道微信在过去一年和未来一定的时间做过和要做的事。聚焦微信生态的商业化能力，小程序、微信支付、小游戏、企业微信、微信公众平台、微信AI等生态产品晒出了过去一年的“成绩单”。听张小龙的话，后面可能要搞短内容，要搞带货吗？ 张小龙说了什么1、微信可能要扩张带货能力了，可能开放5000好友上限，可能增加短内容。2、有大量的数据，什么该用，什么不该用，主动与被动的选择。3、头部大号会有最大的浏览量，但是在一个人人皆可创作的年代，微信希望长尾的小号都有自己的生存空间。4、朋友圈之所以默认是发照片视频的，是因为当时张总有一个认知，即“对于十亿人来说，让每个人发文字是不容易的，但是，发照片是每个人都可以做到的。”5、上了《一门信息发展论》6、突破不了各立山头App间的搜索难题，想做小程序间内部的搜索。 我想说的1、微信真的厉害到很夸张，突破11亿的用户，这个池子真的好大。2、微信的商业化能力还有非常大非常大的空间，可能现在微信还想克制一下自己的欲望。3、在我看来，不管增加什么样的商业化能力，首页一定要一如既往的简介，丰富的功能可以隐藏起来，按需调出，因为我希望微信是简洁的社交工具，以人为中心。4、关于带货和短内容，我在想微信在开放5000好友上限的同时，加入直播、短视频等功能进去之后（满足按需隐藏），会对一批短视频如快手、抖音、淘宝直播等有什么影响。虽然很早之前我就听大学的同学说，她们之前在内测微信直播带货了。5、关于搜索，为啥BATTMDJ……大佬们为啥没有做出类似web端的跨APP间内容搜索的协议或者标准，无法逾越的鸿沟是技术标准还是商业利益。6、现在的推荐算法这么普遍存在，极大的改变了人获取信息的方式，推送或者分发。但是，假设一个人接受了十年的机器推荐的信息，好像快变得只是刷刷刷了，刷微博、刷抖音、刷朋友圈、刷头条、刷公众号…….等等，好像没什么意义了噢 微信过去的能力和未来的能力看历年的微信公开课PPT即可，温故而知新。 晚安，明天去西冲、情人岛。","categories":[{"name":"随笔","slug":"随笔","permalink":"http://www.liantianhua.com/myblog/categories/随笔/"}],"tags":[{"name":"微信","slug":"微信","permalink":"http://www.liantianhua.com/myblog/tags/微信/"},{"name":"短内容","slug":"短内容","permalink":"http://www.liantianhua.com/myblog/tags/短内容/"},{"name":"带货","slug":"带货","permalink":"http://www.liantianhua.com/myblog/tags/带货/"}]},{"title":"在Markdown中添加视频","slug":"在Markdown中添加视频","date":"2020-01-01T08:05:36.000Z","updated":"2020-01-09T13:48:33.085Z","comments":true,"path":"2020/01/01/在Markdown中添加视频/","link":"","permalink":"http://www.liantianhua.com/myblog/2020/01/01/在Markdown中添加视频/","excerpt":"今天我在房琪kiki （Ps:博主好多好看的旅游视频喜欢的话可以关注一下她）的微博上看到新疆禾木村的视频，真美。想着Markdown好像也兼容HTML标签的，试了一下，还真可以。通用的HTML标签可以，同时HXEO也可以安装插件来实现。最主要的问题是，有没有好的视频存放位置（类似图床），避免视频连接的失效。这个视频连接失效了，请点击这里欣赏。 这个&lt;video&gt; 你的浏览器好像不支持哦","text":"今天我在房琪kiki （Ps:博主好多好看的旅游视频喜欢的话可以关注一下她）的微博上看到新疆禾木村的视频，真美。想着Markdown好像也兼容HTML标签的，试了一下，还真可以。通用的HTML标签可以，同时HXEO也可以安装插件来实现。最主要的问题是，有没有好的视频存放位置（类似图床），避免视频连接的失效。这个视频连接失效了，请点击这里欣赏。 这个&lt;video&gt; 你的浏览器好像不支持哦 支持外链的视频可以，或者通过一定的手段生成外链，存在的问题，当然我不会优化。下载到自己的存储空间的话，等花点时间找找免费的支持外链的，或者自己掏钱买。先看看这样好使不，后面去研究一下。","categories":[],"tags":[{"name":"视频","slug":"视频","permalink":"http://www.liantianhua.com/myblog/tags/视频/"},{"name":"神的自留地","slug":"神的自留地","permalink":"http://www.liantianhua.com/myblog/tags/神的自留地/"}]},{"title":"我们一起走过的十年","slug":"我们一起走过的十年","date":"2019-12-31T13:58:00.000Z","updated":"2020-01-01T06:02:30.345Z","comments":true,"path":"2019/12/31/我们一起走过的十年/","link":"","permalink":"http://www.liantianhua.com/myblog/2019/12/31/我们一起走过的十年/","excerpt":"2010-2019，即将过去的十年，是我们95后最无忧无虑的十年，是移动互联网飞速发展的十年，是我从求学到工作切换的十年。 Say Goodbye ，go chasing the 2020s. 现在是北京时间2019年12月31日21点58分，今天的封面选它吧……","text":"2010-2019，即将过去的十年，是我们95后最无忧无虑的十年，是移动互联网飞速发展的十年，是我从求学到工作切换的十年。 Say Goodbye ，go chasing the 2020s. 现在是北京时间2019年12月31日21点58分，今天的封面选它吧…… 自己的感觉十年说长不长，说短不短。这十年，我父母也把我们几个养大了的同时他们就又老了不止十岁，辛苦两老。对于我来说，≈1.5年初中时光+3年高中时光+4年大学时光+1.5年工作时光，加起来正好等于陈奕迅的《十年》，大部分是属于无忧无虑的求学阶段，十年来认识了很多有趣的同学、朋友、同事。2010年詹姆斯转投迈阿密热火，2014年回归故里克利夫兰骑士，2018年远赴洛杉矶湖人。2010我在广西桂平上初中，2014年我到陕西西安上大学，2018年我到广东深圳参加工作。虽没有勒布朗那样功成名就，我依然很欢愉，往日的时光宛如昨日。十年前我们看NBA还是在教室的电视看，然后慢慢的用上了无处不在的移动互联网，这期间我的手机依次换了天语、中兴U880、小米、三星、魅族、苹果。十年前小桂平才刚刚开始修高铁（南广线），如今高铁是我回家的主要交通工具。这十年，真真正正记忆最完整的十年…….感慨一句，时间真的好快好快。 关于过去和未来想总结，但是舞台要留给最权威和专业的，如下： 【习近平发表二〇二〇年新年贺词】 【吴晓波跨年演讲：2020年将发生什么】 下一个十年学习、工作、成家、立业……. 还是这两句话： 前路虽长，尤可期许。 岁岁常欢愉，年年皆胜意。","categories":[{"name":"随笔","slug":"随笔","permalink":"http://www.liantianhua.com/myblog/categories/随笔/"}],"tags":[{"name":"十年","slug":"十年","permalink":"http://www.liantianhua.com/myblog/tags/十年/"},{"name":"2020","slug":"2020","permalink":"http://www.liantianhua.com/myblog/tags/2020/"}]},{"title":"今日份随笔【云服务】-20191220","slug":"今日份随笔【云服务】-20191220","date":"2019-12-19T18:00:06.000Z","updated":"2019-12-19T20:07:26.439Z","comments":true,"path":"2019/12/20/今日份随笔【云服务】-20191220/","link":"","permalink":"http://www.liantianhua.com/myblog/2019/12/20/今日份随笔【云服务】-20191220/","excerpt":"现在是北京时间2019年12月20日凌晨2：05分，距离21世纪第三个十年的第一年2020年还有10天多一点点，此时此刻还很精神，兴趣来了睡意全没。昨晚看到一张图，因为这张图我折腾到现在，今天的封面就选它吧……","text":"现在是北京时间2019年12月20日凌晨2：05分，距离21世纪第三个十年的第一年2020年还有10天多一点点，此时此刻还很精神，兴趣来了睡意全没。昨晚看到一张图，因为这张图我折腾到现在，今天的封面就选它吧…… 折腾到这个点的原因看新闻看到封面的图，太有话题感这个图，看看这些关键词：钱、年会、 IPhone 、奖金………..而，我关注的是腾讯云。然后我就顺着这个腾讯云，去展开了解，腾讯、云服务、B\\G端业务、转型……越来越多的词浮现在脑海中,去检索了这些词看了好几个小时，越看越精神。最惊喜的一个点是，突然间发现BATJ阵营中，好像唯独腾讯的CTO职位空缺，震惊。 云服务我记得我第一次接触云计算这个概念，应该是大二(2015-2016年)的时候，那时候有个挺火的网课培训，优达学城的人工智能网课纳米学位的项目，跟着做那些简单的入门训练，后来灿哥就搞了一个信用卡，让我去在亚马逊AWS上开一台EC2，用上面的GPU（这玩意当时好像是1$/H,好贵）训练模型，那时候当然不会，然后就在晚上看教程去配置好了一台云主机及相关的服务，后来重置了个服务器（免费一年）搭建了vpn服务，一个舍友分一个端口号，还挺开心，这就是我的初体验。在我的理解看来，就是一台放在远处的电脑，工作之后才发现，里面门道太多了。云计算（英语：Cloud Computing），是一种基于互联网的计算方式，通过这种方式，共享的软硬件资源和信息可以按需求提供给计算机和其他设备。具体实现的方式有： IaaS(Infrastructure-as-a- Service)：基础设施即服务消费者通过Internet可以从完善的计算机基础设施获得服务，换成我们通常理解的内容来讲就是我们不用购置硬件（服务器、存储等），不用去考虑如何把服务器连上网，只需要我们购买IaaS服务就可以使用这些硬件的服务。 PaaS(Platform-as-a- Service)：平台即服务PaaS实际上是指将软件研发的平台作为一种服务，以SaaS的模式提交给用户。这里的平台换成我们理解的就是应用程序运行所需要的环境，如果我们部署PHP开发程序就需要有Apache等引擎支持。用Java的需要Tomcat等支持。 SaaS(Software-as-a- Service)：软件即服务它是一种通过Internet提供软件的模式，用户无需购买软件，而是向提供商租用基于Web的软件，来管理企业经营活动。 这里面的玩家挺多的，亚马逊、微软、Google、甲骨文、阿里、腾讯、百度、京东、新浪、华为、七牛等很多，以前区分还是很明显的，现在基本上头部的玩家都是在IaaS的基础上，同时提供PssP及SaaS服务。去看了看这些玩家的官网，国外的主页明显的侧重性能及服务，国内这边还是交战颇为激烈，基本是清一色的满减广告，还是有非常大的机会和空间去给各家拉开差异化的，现阶段还是先铺量为主。关于价格、性能、优劣情况，门外汉就不讨论了，有朝一日如果入行了，回来补更一个专业的帖。 腾讯B/G端业务表明立场：未来看多CSIG云与智慧产业事业群，看好B/G端业务 腾讯与云服务相关的事业部，看了下新闻是去年9月30日重新架构调整出来的，CSIG云与智慧产业事业群。2019年裁员这么明显，线上的人口红利流量红利也没这么明显了，传统的实业今年也不好过，涨跌全看特朗普（玩笑）。我记得好多的开发者大会世界大会互联网大会上，头部玩家的主旋律基本离不开人工智能、区块链、产业互联网这些主题，到今年三季度好像阿里云服务的收入有290亿左右？腾讯官宣的100亿，AWS的270亿美元，确实在B/G端还是有很大的想象空间。像腾讯拥有微信这么牛逼的流量亲儿子，去做B/G端的生意应该很不错，类似像广深的交通服务、政务服务、衣食服务、新零售。ps:这几天去办证件，深圳的政务服务真的要去点赞。慢慢从C端游击战到B/G端，稳重有进，归根结底服务的对象都是人。但是C端的业务跟B/G端实现方式上有很大差别，毕业至今我做了17个月B/G端的项目及业务相关的管理，这些项目还不全是有技术实力就能拿下这些大项目的，就算是没有同质化严重的时段，很大的一部分是要去靠销售部门去做商务工作，投入大量的精力和钱，谈妥了再去竞标，还是挺复杂的。刚才在网上看到一段话，写得挺有意思的，这里截一下。 总结成两点：1.需要时间和机会去适应这种节奏、场景、行为、市场环境等2.To B/G业务链条长、周期长、账期长、客户需求差异巨大，与短平快的To C业务有着本质上的差别。（图里面说的，我觉得很有道理，特别特别是这三长） 四年估计赚了200亿（宝能姚老板）四年前的万科（贴个大牛猫做的图，如下），这个月的南宁百货，猪脚都是宝能姚老板。四年前因为万科这个事，我还专门去图书馆看了这本《门口的野蛮人》，不过那时候不怎么理解，争取2020年再重温一遍。 晚安。","categories":[{"name":"随笔","slug":"随笔","permalink":"http://www.liantianhua.com/myblog/categories/随笔/"}],"tags":[{"name":"云服务","slug":"云服务","permalink":"http://www.liantianhua.com/myblog/tags/云服务/"},{"name":"As A Service","slug":"As-A-Service","permalink":"http://www.liantianhua.com/myblog/tags/As-A-Service/"}]},{"title":"今日份随笔-20191213","slug":"今日份随笔-20191213","date":"2019-12-13T15:56:25.000Z","updated":"2019-12-14T16:23:52.843Z","comments":true,"path":"2019/12/13/今日份随笔-20191213/","link":"","permalink":"http://www.liantianhua.com/myblog/2019/12/13/今日份随笔-20191213/","excerpt":"今天在朋友圈看到朋友发了张《青年文摘》的杂志封面照片，想起高一读书的时候，那会大家都喜欢上课偷偷摸摸看《青年文摘》和《读者》，很开心的岁月。今日份就上一张《读者》封面做今日份封面……","text":"今天在朋友圈看到朋友发了张《青年文摘》的杂志封面照片，想起高一读书的时候，那会大家都喜欢上课偷偷摸摸看《青年文摘》和《读者》，很开心的岁月。今日份就上一张《读者》封面做今日份封面…… 2019年末今年年末的关于裁员的新闻挺多的，大到华为网易，小到小型创业公司。2018年一起毕业的大学同学，包括我在内都有不少于5个人已经或者正在经历裁员，北上广深都有。双十一的时候跟几个高中的朋友一起在深圳吃饭，他们说他们资金链也在经历巨大的考验，工资拖了一个多月没发出来了。这么看来，经营困难及裁员优化这种状况在今年年末尤为明显，大家都说大环境不好今年，仁者见仁智者见智吧。昨天我去福田办证件的时候（哇，深圳的政务服务真的体验特别好，点赞），朋友微信跟我说他也在谈判中，结束一起去海南自驾游，就如16个月前一拍即合来深圳那样一拍即合。倒也不是特别特别严重对我们几个来说，也借这段时间重新休整一下自己，把今年没看的书看了，去趟海南吹吹风，补补该补的技能，然后喜迎2020。 中方关于中美第一阶段经贸协议的声明哇，这真是个大事，22：30推迟到23：00官宣，根据咱们党的做事风格，专门开个发布会的，肯定是好消息。如果是坏消息，别说发布会，你都没地方讨论。最明显的体现就是我关注财经政治相关的公众号，十分钟之内收到了五条相关的推送，周一应该吃红透天吧？周五证券板块好像已经4%往上走了。说起这个贸易战，2018年的时候中兴被制裁，把我（穷学生）的5000块毕业旅游经费搞没了，心疼啊哈哈哈哈。今天还Mark到一个词-戴维斯效应（戴维斯双击与戴维斯双杀），后面找个时间看看是什么概念。 指数基金上个月问女朋友，懂不懂什么是K线？什么是ETF？不懂，然后就让她买些书看看，然后就她买回了雪球大V银行螺丝钉的《指数基金投资指南》。这几天时间比较多，我也打算拿来阅读一下。前辈说，韭菜就买指数基金，大部分的股票都跑不赢指数基金。买指数基金就是赌国运，老美纳指的过去十年或许就是未来中国大A的未来十年，当然是选择看多我们大A。","categories":[{"name":"随笔","slug":"随笔","permalink":"http://www.liantianhua.com/myblog/categories/随笔/"}],"tags":[{"name":"环境","slug":"环境","permalink":"http://www.liantianhua.com/myblog/tags/环境/"},{"name":"理财","slug":"理财","permalink":"http://www.liantianhua.com/myblog/tags/理财/"}]},{"title":"【周末行】2019深圳产品运营大会（极光数据）","slug":"【周末行】2019深圳产品运营大会（极光数据）","date":"2019-09-01T08:04:06.000Z","updated":"2019-09-01T08:20:45.051Z","comments":true,"path":"2019/09/01/【周末行】2019深圳产品运营大会（极光数据）/","link":"","permalink":"http://www.liantianhua.com/myblog/2019/09/01/【周末行】2019深圳产品运营大会（极光数据）/","excerpt":"主题：提升用户体验 降低用户流失时间：2019年8月31日 13:30 ～ 17:30地点：广东深圳市福田区新洲南路2008号新洲同创汇","text":"主题：提升用户体验 降低用户流失时间：2019年8月31日 13:30 ～ 17:30地点：广东深圳市福田区新洲南路2008号新洲同创汇 这期，严重跑题了。都是广告。。。。没什么感触，中途走了。","categories":[],"tags":[{"name":"产品","slug":"产品","permalink":"http://www.liantianhua.com/myblog/tags/产品/"},{"name":"商业","slug":"商业","permalink":"http://www.liantianhua.com/myblog/tags/商业/"},{"name":"运营","slug":"运营","permalink":"http://www.liantianhua.com/myblog/tags/运营/"}]},{"title":"【周末行】三节课大讲堂-深圳站","slug":"【周末行】三节课大讲堂-深圳站","date":"2019-08-17T16:42:28.000Z","updated":"2019-08-27T15:27:25.595Z","comments":true,"path":"2019/08/18/【周末行】三节课大讲堂-深圳站/","link":"","permalink":"http://www.liantianhua.com/myblog/2019/08/18/【周末行】三节课大讲堂-深圳站/","excerpt":"主题：探索互联网生态下多维度的产品创新时间：2019年8月17日 13:00 ～ 17:30地点：广东深圳南山区西丽平山民企科技园5栋北1层亚咖啡SIA CAFE 2018年，互联网企业开始加快传统业务转型升级的步伐，智能零售、社交电商、电子竞技、短视频等新模式快速兴起。同时，将目光转向企业市场，通过数字化改造、开放服务能力等手段赋能B端，工业/产业互联网业务也开始加速发展。","text":"主题：探索互联网生态下多维度的产品创新时间：2019年8月17日 13:00 ～ 17:30地点：广东深圳南山区西丽平山民企科技园5栋北1层亚咖啡SIA CAFE 2018年，互联网企业开始加快传统业务转型升级的步伐，智能零售、社交电商、电子竞技、短视频等新模式快速兴起。同时，将目光转向企业市场，通过数字化改造、开放服务能力等手段赋能B端，工业/产业互联网业务也开始加速发展。2018年底至2019年初，中国互联网巨头几乎同步启动战略重组，不约而同地在组织架构中增设“中台”，将未来转型ToB计划提上日程。这些被业界成为“大中台，小前台”的战略调整，将是企业的核心能力、数据、用户信息以共享服务的形式加以沉淀，控制重复建设，降低创新成本。这一轮调整背后，更深层次目的是以组织架构重组带动业务发展模式变革，以能力集约化沉淀方式再造企业战略拓展的创新竞争力，从而更好地适应从消费互联网向工业产业互联网的转型升级。 小前台大中台“中台”概念起源于军事范畴，强有力的中台建设是领先企业持续做大做强的推进器，中台目标是打造具有生物型的生态系统能力。伴随着数据越来越多，假如一个企业有数十个甚至上百个应用的时候，就会有有明显的重复建设、资源浪费，甚至更严重的是因建设者不同而造成口径标准都不一致。另一方面，数据量庞大的时候，增删改查也会变得非常缓慢。“数据中台”就是这样随需求而来的概念，希望存在一个提供公共的数据服务能力的地方，大家可以从这里快速获取这些能力，来支撑新的数据应用，且各部门都能保持一致。数据中台强调的是一种数据共享能力、模块复用能力以及业务互通能力,以应对多业务形态扩张、多渠道消费触达、多角色生态参与、多变的外界挑战。中台的核心本质就是：业务为本、网络连接、数据智能。 回归需求的本质产品是为了满足人们的需求而被生产出来的,因为需求的驱动,才会使得用户需要产品，互联网产品就是通过互联网技术来满足人类的需求。美国心理学家亚伯拉罕·马斯洛于1943年提出了需求层次理论，分为生理需求、安全需求、社交需求、尊重需求和自我实现需求。多种潜在对象，如用户需求、产品运营需求、系统性能需求等。小的方面来说，需求是一个好产品的前提，是一个优秀产品的起点。多种潜在对象，如用户需求、产品运营需求、系统性能需求等。 重视用户价值、关注商业价值互联网产品设计的第一件事情，要考虑，商业价值如何通过实现用户价值而实现。要想达到商业价值，首先要思考我们产品的用户（客户）是谁？我们的产品通过服务这些用户、满足目标用户的基本需求后，即产生了用户价值。但是用户价值不等于商业价值，须通过一定的商业运作模式把用户价值转化成商业价值.","categories":[],"tags":[{"name":"产品","slug":"产品","permalink":"http://www.liantianhua.com/myblog/tags/产品/"},{"name":"数据中台","slug":"数据中台","permalink":"http://www.liantianhua.com/myblog/tags/数据中台/"},{"name":"商业逻辑","slug":"商业逻辑","permalink":"http://www.liantianhua.com/myblog/tags/商业逻辑/"},{"name":"学习","slug":"学习","permalink":"http://www.liantianhua.com/myblog/tags/学习/"}]},{"title":"【周末行】拉萨-雪域之都","slug":"【周末行】拉萨-雪域之都","date":"2019-07-25T16:13:25.000Z","updated":"2019-08-25T15:51:39.926Z","comments":true,"path":"2019/07/26/【周末行】拉萨-雪域之都/","link":"","permalink":"http://www.liantianhua.com/myblog/2019/07/26/【周末行】拉萨-雪域之都/","excerpt":"曾虑多情损梵行，入山又恐别倾城。世间安得双全法，不负如来不负卿。住进布达拉宫，我是雪域最大的王。流浪在拉萨街头，我是世间最美的情郎。","text":"曾虑多情损梵行，入山又恐别倾城。世间安得双全法，不负如来不负卿。住进布达拉宫，我是雪域最大的王。流浪在拉萨街头，我是世间最美的情郎。 机缘巧合在这之前，我没来过拉萨。因为公司再拉萨这边的项目有临时紧急的任务，机缘巧合的安排了我过来执行。这期间来了两次经历了两个周末，终身难忘的是第一次的轻微高原反应。 初印象人类的恐惧源于对未知的不安。接到任务的第二天就得空降拉萨，因为没来过，所以在网上查了不少信息和资料，“高发”绝对是出现在搜索结果页面频次最高的词汇。问了同事，同事说一个人到拉萨，千万不要洗澡！我慌了……从深圳过去其实很折腾的，深圳没有直达的航班，需要从重庆或者成都转机，早上六点出门、折腾到拉萨已经下午三点多了。下飞机，感觉没什么不舒服，天空好蓝啊，空气好好啊，这温度在七月舒服啊。（前辈老吓我小心高反，此时好像没什么反应。）到市区的时候路过传说中的布达拉宫，二话不说拿起手机就是前置摄像头三连拍，（心理活动：哇哇哇，一直想来打卡的地方，好壮观）放下行李，立马去执行任务，还顺利，三个小时搞定。抬头看下天空，这都21：00了天还亮，打开手机地图看了下拉萨与深圳的相对位置，找到了答案。 一个人，在这个旅游的城市，不知道吃啥？？？？好吧，城市便捷对面有个粤菜馆，好吧吃晚茶吧。初印象-哇哇哇三连、好神圣、天空好蓝、天气好好。 结果晚上头疼睡不着、半夜发烧的感觉、第二天白天就正常了。（前辈警告得对） 漫步拉萨拉萨城区不大。生活节奏很慢。公共交通系统较差、滴滴打车很方便、很多四川的司机跑滴滴。美食？找不到合适我口味的。真的看得了虔诚的信徒，三步一朝拜，真的很虔诚。（仅限当地有宗教文化基础的藏民）去拉萨打卡的，说是去净化心灵的我不信。 小结西藏的大好风景不在拉萨市区，市区布达拉宫必去（要提前一天预订才能进去）、大昭寺、八郭街、、 相信高反是一定会有的、就是看个人体质明不明显，夏天还好，空气含氧量听说是平原的75%左右，冬天的话应该是60%左右，所以还是789月合适去高原。 一定要带备用的衣服，第二次去的时候是八月初，山上下雪了吓我一跳。还有注意防晒 拉萨还是要去一下的，满足一下内心对这个神圣的地方的打卡欲望。","categories":[],"tags":[{"name":"城市","slug":"城市","permalink":"http://www.liantianhua.com/myblog/tags/城市/"},{"name":"照片","slug":"照片","permalink":"http://www.liantianhua.com/myblog/tags/照片/"},{"name":"拉萨","slug":"拉萨","permalink":"http://www.liantianhua.com/myblog/tags/拉萨/"}]},{"title":"【周末行】深圳蛇口价值工厂","slug":"【周末行】深圳蛇口价值工厂","date":"2019-07-21T09:53:30.000Z","updated":"2019-07-21T16:16:28.502Z","comments":true,"path":"2019/07/21/【周末行】深圳蛇口价值工厂/","link":"","permalink":"http://www.liantianhua.com/myblog/2019/07/21/【周末行】深圳蛇口价值工厂/","excerpt":"怎么去？深铁2号线【蛇口港站】———&gt;70路公交【价值工厂站】———&gt; 下车走2分钟","text":"怎么去？深铁2号线【蛇口港站】———&gt;70路公交【价值工厂站】———&gt; 下车走2分钟 关于价值工厂价值工厂是蛇口很偏僻很偏僻一个废旧的玻璃工厂改造而成的，现在被改造成了创意工业园，然在退出原来的历史舞台中却登上了另一个时代的舞台。一个废弃工厂改成的价值工厂，复古工业风，园区不需要门票，人不多，拍照可以很随心所欲。因为周星驰执导的电影《美人鱼》在此取景，变得出名起来。前身是广东浮法玻璃厂，在工厂搬离之后，因2013年的双年展而焕发出新的生机。这里有很多与环境巧妙结合、创意十足的涂鸦，特别有趣，能拍出很多很有意思的照片。去过北京的年轻人都知道北京有个798，来深圳的人不一定都知道价值工厂。 水平不好的照片 这个周末怎么过的？ 周六上午：加班开了4个小时的视频会议。周六下午：椰子鸡回来之后暴雨，休息。周天上午：探寻价值工厂。周天下午：海岸城陪逛街陪吃饭。周天傍晚：宝体游泳馆2小时游泳。周天深夜：更新Blog，准备新一周的工作计划。","categories":[],"tags":[{"name":"照片","slug":"照片","permalink":"http://www.liantianhua.com/myblog/tags/照片/"},{"name":"周末活动","slug":"周末活动","permalink":"http://www.liantianhua.com/myblog/tags/周末活动/"},{"name":"文化艺术区","slug":"文化艺术区","permalink":"http://www.liantianhua.com/myblog/tags/文化艺术区/"}]},{"title":"【周末行】网易MCtalk新消费CXO论坛","slug":"【周末行】网易MCtalk新消费CXO论坛","date":"2019-07-14T13:30:42.000Z","updated":"2019-07-20T12:30:44.055Z","comments":true,"path":"2019/07/14/【周末行】网易MCtalk新消费CXO论坛/","link":"","permalink":"http://www.liantianhua.com/myblog/2019/07/14/【周末行】网易MCtalk新消费CXO论坛/","excerpt":"一切商业进步只有一个方向—&gt;&gt;&gt; 效率 阿尔法狗大胜围棋天才，索菲娅被赋予公民身份，波士顿动力机的器狗会后空翻，人工智能AI以迅雷不及掩耳之势出现在人们视野，成为目前人类所面临的较为重要的技术变革之一。大数据及人工智能时代已经来临，几乎全球所有的国家都在期待着人工智能的突破与发展,路漫漫挺坎坷。","text":"一切商业进步只有一个方向—&gt;&gt;&gt; 效率 阿尔法狗大胜围棋天才，索菲娅被赋予公民身份，波士顿动力机的器狗会后空翻，人工智能AI以迅雷不及掩耳之势出现在人们视野，成为目前人类所面临的较为重要的技术变革之一。大数据及人工智能时代已经来临，几乎全球所有的国家都在期待着人工智能的突破与发展,路漫漫挺坎坷。 【周末行】的缘由 理由一：不想周末在家宅了，想走出舒适的夏天三件套（空调、西瓜、笔记本）。理由二：想出去呼吸一下‘新鲜’空气，拓宽一下眼界，感受一下2019的商业变革及技术趋势。理由三：去了解别人的演讲准备（涵盖演讲文档的准备、演讲的细节表现等），如何讲好一个商业故事。理由四：回头看下自己的BLOG挺久没更新了，出去寻找一些素材，顺带放松一下自己。 活动的安排 时间：2019年7月13日（周六）14:00-17:00地点：广东省深圳市福田区星河丽思卡尔顿酒店13:30-14:00 签到与互动14:00-14:30 《AI时代下的服务与营销“智”变》 网易智慧企业部 –肖钰妍14:30-15:00 《抖音三洞察》 抖音巨量引擎 –马里15:00-15:30 《慧眼神瞳-视觉智能伴随每份快递快乐到家》 顺丰科技-宋翔15:30-16:00 《S-T-A-R模型化构建品牌营销引力场》 唯品会 –赵思涵16:00-16:30 《超级猩猩的智能商业实战分享》 超级猩猩-刻奇16:30-17:00 【圆桌讨论】数据 X 智能如何驱动商业变革？ 关于嘉宾主题分享的思考 网易 智慧企业部产品总监-肖钰妍智能化是手段但不是目的，优质、卓越、极致的用户体验才是我们所要实现的最终目标。 大数据、人工智能带来的其中一个看得见的改变就是，当我们在电商平台上购物需要咨询客服时，机器人客服提前把我们关心的问题和答案推送给我们了，就像已经看透了消费者的心思。当前消费者存在于线上、线下、售前、售后等所有环节，从而为消费者提供了优质甚至是极致的服务。同时让合适的消费者被合适的人接待，是对消费者本身的尊重和提高极致服务能力的一种表现。尝试让AI与人更好地协同合作，即通过智能识别消费者负面情绪，将服务转接至人工接待，实现用户与服务的最佳匹配。 以上是一种美好设想，但是针对C端的AI客服，目前的方案还远远未到达要求。其一：客服做的事情虽然具有重复性且较为基础，但本质上是人与人的对话和交流，在解决用户问题的同时涉及到情绪的识别，用户核心需求的把握，甚至还有很多闲聊场景，这些如果采用纯机的方式带来的体验是极差的，当前的智能对话系统技术还待完善，很多用户是因为体验智能对话系统的体验差变不想再次体验，这在to c的产品来说要求很严格，用户对机器错误率有不同的容忍度，所以当机器犯错时，用户的满意度也会出现较大差异。其二：用户和机器对话的场景是非常复杂的，涉及到开放域对话和限定域对话，有很多复杂场景涉及到操作类的解决方案，这些都是机器很难识别和自动处理的，需要人工辅助，机器对于需要操作类的问题只能通过引导用户自行解决或是限定条件让客户自行选择，及限定用户的选择路径。对于用户体验而言都是有很多打击的，用户的核心需求是高效的处理他的问题，希望客服直接解决相关问题。 目前在AI领域里面，现在衍生了不少数据工厂，专门做数据标记，后面应该还会产生AI客服训练师或者数据喂养员这种职业，需要不断去“饲养”机器，训练优化数据模型，实现最终的目标。 抖音 创意及营销中心策略及知识总监-马里关键字：洞察；不可忽略的追随者效应。 好的创意离不开好的洞察，会上马里分享了如何借助抖音找到好的创意洞察，并将洞察转化为落地的内容。洞察有三个层面，马里介绍道，即“社会人群洞察”、“消费人群洞察”、“参与人群洞察”。建立相关性锁定人群，把品牌的产品、服务、品牌与某一个人群建立相关性，之后要基于消费行为建立共鸣，最后把品牌的产品和解决方案跟情境关联在一起，这样才可以做到好的消费人群洞察。洞察是内容的基础，只有对用户有精准切实的洞察，才能引发情感共鸣，达成营销目的。 我记得在上大学大会，也就是2015年那阵子，很流行的一个词-痛点，有痛点的地方就有需求，有痛点的地方就有商机。用户洞察与用户研究和分析不一样的在于，用户洞察更把人当作人，而不是数据或者指标。用户研究更多是一种工具和方法，在大多数情境下用于帮助业务解决一些线性增长的问题，例如：挖掘潜在的额外的20%客群。而用户洞察是一种能力，是一种帮助你不依靠太多数据和调研准确的抓住或者创造那一个关键的打动‘人’的核心点，带来指数级增长或者是创造全新模式的能力。洞察是一个研究心累学的范畴，从马斯洛需求层次来说生理需求、安全需求、社交需求、尊重需求和自我实现需求,这属于哪个？有一种说法叫灵魂出窍从第三者视角看自己。 用户洞察是对用户价值、喜好和倾向的深刻理解，直击心灵的那种哦。 顺丰科技 计算机视觉总工程师-宋翔价值，是影响一个AI技术商业化方向的核心。 在电商平台上下单后，就是等待快递送货上门。一件物品从寄出到收件，其中有多少的大数据手段加持呢?顺丰科技计算机视觉总工程师宋翔介绍了顺丰如何借力“慧眼神瞳”这一计算机视觉系统，保障物流每个环节，让快递物品安全到达消费者手中的全过程。顺丰在物品收件、网点、中转场、运输、派送、收件等各个环节部署了30万个监控摄像机，并联合使用物联网、运算优化等技术，解决了物流在场地内、运输过程中，人员、货物、场地以及车辆等各个方面的问题。 顺丰AI Argus视频结构化分析平台，让计算机看懂物流。 可实时监测各场地各类暴力违规操作，有效降低破损件和丢失件概率。为全网提供车辆装载率、车辆调度、运力监测和场地人员能效等基础数据。持续反馈各场地实时装载率数据，优化运力成本。实现全网标准化业务管理，6S管理，消除管理黑洞。 最开始接触到计算机视觉这种东西的时候，那是还是大二（2015年），感谢《Python与推荐系统》卫博士的引导，才慢慢去接触这些领域，那时候商汤、旷视、云从、依图、图森、格灵深瞳可谓名声大噪。企业从技术切入没问题，但如果只是空有技术，或者技术瞄准的方向跟市场有很远的距离，那注定会失败。学术界和真正的生产环境有着非常大的差距，技术从学术上想直接转化到市场生产环境几乎是生殖隔离。真实有效的规模化刚需，我们做任何一件事，哪怕拥有一个特别牛的技术，一定最终是从需求出发的，一定是要说我到底给用户创造了什么价值。 唯品会 商业赋能部策略负责人-赵思涵关键词：Scene &gt; Tactics &gt; Action &gt; Revenue 通过大数据和人工智能这一工具创新营销模式，保障服务质量，提升消费者的服务体验，是本次论坛分享嘉宾的共同观点。在电商平台购物，与机器人客服沟通交流前，首先发生的行为自然是产生购物需求。这个过程中，大数据和人工智能又是发挥了怎样的作用?唯品会商业赋能部策略负责人赵思涵分享了唯品会如何借助场景、策略、行动、收益四位一体的S-T-A-R模型，利用数据，构建品牌营销引力场，实现产品的高速增长。比如，在营销过程中，唯品会借助商品数据匹配、标签数据，对每个用户的购买行为、喜好、贡献度等进行标记，针对不同的用户群体，在不同场景下，根据不同媒体属性，推送不同产品，实现精准营销。 超级猩猩 联合创始人-刻奇关键字：数据即决策。 时下城市白领的一大流行喜好之一就是健身。超级猩猩联合创始人刻奇介绍了零售健身品牌在智能化方向的尝试。为提升用户体验，超级猩猩传统的健身房业务进行了数字化的体验升级。用户只需要在小程序上就可以预约课程，而无需再通过前台。用户线上行为积累的数据，为超级猩猩门店提供了用户的消费行为、运动习惯，以及教练课程供需情况等大量信息。同时，数据中台还能为超级猩猩提供访问用户的分布、消费用户的分布、高净值用户的分布以及已覆盖区域用户的特征和未覆盖的区域等内容，为公司在门店选址上提供数据驱动决策。因此，在刻奇看来，智能化帮助实现“数据即决策”。经常看NBA的球迷都知道NBA现在在场馆布置了许多行为跟踪的摄像头，用来采集比赛和训练的数据，提供给教练员及运动员做决策，真的想不到现在的线下健身馆也能将数据用到这么好。 钱大妈 深圳电商事业部负责人-吴鹍鹏一切商业进步只有一个方向，效率。 钱大妈市场负责人吴鹍鹏在分享中表示，企业的本质是追求效率。在他看来，提高效率的方法就是CAD。首先是Cloud，高灵活性、高拓展性、高性价比，去中心化，让自由人能够自由组合;其次是AI，将复杂问题简单化，将不可衡量的变成可衡量的，化繁为简，高效执行;最后是Digitalization，更加坚决地数字化，越来越高效的记录、传播、分享。其实这个都不重要，我觉得他说的下面这段话是对的。 人生在世有三个追求是不证自明的： 第一、人都想要进步。第二、人都追求幸福。第三、人都追求自由。 结语大数据与人工智能广泛应用的时代，数据与智能就是生产力，事无巨细都离不开数据和智能，它们也深刻影响着消费体验与服务的改变。可以预见的是，人工智能时代，数据与智能将成为新消费营销与服务最强大的资本。","categories":[],"tags":[{"name":"周末活动","slug":"周末活动","permalink":"http://www.liantianhua.com/myblog/tags/周末活动/"},{"name":"商业趋势","slug":"商业趋势","permalink":"http://www.liantianhua.com/myblog/tags/商业趋势/"},{"name":"技术杂谈","slug":"技术杂谈","permalink":"http://www.liantianhua.com/myblog/tags/技术杂谈/"}]},{"title":"Facebook Libra(天秤座)白皮书","slug":"Facebook-Libra-天秤座-白皮书","date":"2019-06-25T15:19:32.000Z","updated":"2019-06-25T16:08:13.388Z","comments":true,"path":"2019/06/25/Facebook-Libra-天秤座-白皮书/","link":"","permalink":"http://www.liantianhua.com/myblog/2019/06/25/Facebook-Libra-天秤座-白皮书/","excerpt":"Libra 的使命是建立一套简单的、无国界的货币和为数十亿人服务的金融基础设施。本白皮书概述了我们努力打造一个新的去中心化区块链、一种低波动性加密货币和一个智能合约平台的计划，以期为负责任的金融服务创新开创新的机遇。","text":"Libra 的使命是建立一套简单的、无国界的货币和为数十亿人服务的金融基础设施。本白皮书概述了我们努力打造一个新的去中心化区块链、一种低波动性加密货币和一个智能合约平台的计划，以期为负责任的金融服务创新开创新的机遇。 简介问题陈述互联网和移动宽带的诞生令全球数十亿人得以获得世界各地的知识与信息、享受高保真通信，以及各种各样成本 更低、更便捷的服务。如今，只需使用一部 $40 美元的智能手机，即可在世界上几乎每一个角落使用这些服务1。这 种互联便利性让更多人得以进入金融生态系统，从而推动了经济赋权。通过共同努力，科技公司和金融机构还开发 出了帮助增强全球经济赋权的解决方案。尽管取得了这些进展，但世界上仍有很多人游离在外。全球仍有 17 亿成年 人未接触到金融系统，无法享受传统银行提供的金融服务，而在这之中，有 10 亿人拥有手机，近 5 亿人可以上网。 对于很多人而言，金融系统的某些方面与互联网诞生前的电信网络颇为相似。二十年前，在欧洲发送一条短信的平 均价格是 16 欧分。而现在，只需要一部购买了基本流量套餐的智能手机，任何人都可以在全球范围内免费通信。那 时的通信服务很贵，但是价格是统一的;而如今由于受到成本、可靠性和汇款流畅性方面的影响，迫切需要金融服务 的人往往获得的金融服务不足或会受到限制。 纵观全球，穷人为金融服务支付的费用更多。他们辛辛苦苦赚来的收入被用来支付各种繁杂的费用，例如汇款手续 费、电汇手续费、透支手续费和 ATM 手续费等。发薪日贷款的年化利率可能达到 400% 甚至更高，仅借贷 $100 美元 的金融服务收费便可高达 $30 美元。当被问及为什么仍然徘徊在现行金融体系的边缘时，那些仍“未开立银行帐户” 的人往往指出:没有足够的资金，各种不菲且难以预测的费用，银行距离太远，以及缺乏必要的手续材料。 区块链和加密货币具有许多独特的属性，因而具备解决金融服务可用性和信誉问题的潜力。这些属性包括:分布式 管理，确保网络不受单一实体控制;开放访问，允许任何能连接互联网的人参与其中;以及安全加密技术，保护资金 安全无虞。 但是，现有的区块链系统尚未获得广泛采用。现有区块链缺乏可扩展性，加密货币具有波动性，到目前为止，这些因 素导致现有的加密货币在保值和交换媒介方面均表现欠佳，因而阻碍了它们在市场上的广泛使用。另外，一些项目 还试图破坏现有体系并绕过监管，而不是在合规和监管方面进行创新，以提高反洗钱举措的效力。我们相信，携手金 融部门(包括各个行业的监管机构和专家)进行合作和创新，是确保为这一新体系建立可持续、安全和可信的支撑框 架的唯一途径。这种方法能够实现巨大的飞跃，让我们朝着更低成本、更易进入、联系更紧密的全球金融系统迈进。 机遇在我们携手踏上这段征程之际，我们认为有必要向社群分享我们的信念，以便于了解我们计划围绕这一倡议建立 的生态系统: 我们认为，应该让更多人享有获得金融服务和廉价资本的权利。 我们认为，每个人都享有控制自己合法劳动成果的固有权利。 我们相信，开放、即时和低成本的全球性货币流动将为世界创造巨大的经济机遇和商业价值。 我们坚信，人们将会越来越信任分散化的管理形式。 我们认为，全球货币和金融基础设施应该作为一种公共产品来设计和管理。 我们认为，所有人都有责任帮助推进金融普惠，支持遵守网络道德规范的用户，并持续维护这个生态系统的完整性。 Libra 简介我们的世界真正需要一套可靠的数字货币和金融基础设施，两者结合起来必须能兑现“货币互联网”的承诺。 在移动设备上保护金融资产应该既简单又直观。无论您居住在哪里，从事什么工作或收入怎样，在全球范围内转移 资金应该像发送短信或分享照片一样轻松、划算，甚至更安全。金融生态系统的新产品创新和新参与者将有助于降 低每个人的获取资本的难度，同时为更多人提供顺畅无缝的支付体验。 现在正是在区块链技术的基础上创造一种新型数字货币的最佳时机。Libra 的使命是建立一套简单的、无国界的货 币和为数十亿人服务的金融基础设施。Libra 由三个部分组成，它们将共同作用，创造一个更加普惠的金融体系: 它建立在安全、可扩展和可靠的区块链基础上;它以赋予其内在价值的资产储备为后盾;它由独立的Libra协会治理，该协会的任务是促进此金融生态系统的发展。Libra 货币建立在“Libra 区块链”的基础上。因为它旨在面向全球人民提供服务，所以实现 Libra 区块链的软件是开 源的，以便所有人都可以在此基础上进行开发，且数十亿人都可以依靠它来满足自己的金融需求。设想一下，开发者 和组织机构将构建一个开放、可彼此协作的金融服务生态系统，帮助人们和公司持有和转移 Libra 以供日常使用。 随着智能手机和无线数据的激增，越来越多的人将通过这些新服务上网和使用 Libra。为了使 Libra 生态系统能够 在一段时间内实现这一愿景，我们从零开始构建了其所需的区块链，同时优先考虑了可扩展性、安全性、存储效率 和处理量以及对未来的适应性。请继续阅读有关 Libra 区块链的概述，或阅读技术论文。 这种货币单位被称为“Libra”。Libra 需要被很多地方接受，且对于那些想要使用它的人而言应该易于获得。换言之， 人们需要相信他们可以使用 Libra，并且相信其价值将随着时间的推移保持相对稳定。与大多数加密货币不同，Libra 完全由真实资产储备提供支持。对于每个新创建的Libra 加密货币，在 Libra 储备中都有相对应价值的一篮子银行存 款和短期政府债券，以此建立人们对其内在价值的信任。Libra 储备的目的是维持 Libra 加密货币的价值稳定，确保 其不会随着时间剧烈波动。请继续阅读有关 Libra 及其储备的概述，或前往此处查看详情。 Libra 协会是一个独立的非营利性成员制组织，总部设在瑞士日内瓦。协会旨在协调和提供网络与资产储备的管理 框架，并牵头进行能够产生社会影响力的资助，为普惠金融提供支持。本白皮书说明了其使命、愿景和权限范围。协 会的成员系统由运作 Libra 区块链的验证者节点网络构成。 Libra 协会的成员将包括分布在不同地理区域的各种企业、非营利组织、多边组织和学术机构。共同负责协会章程 定稿，并在完成后成为协会“创始人”的首批组织包括(按行业): 支付业: Mastercard, PayPal, PayU (Naspers’ fintech arm), Stripe, Visa 技术和交易平台: Booking Holdings, eBay, Facebook/Calibra, Farfetch, Lyft, MercadoPago, SpotifyAB, Uber Technologies, Inc. 技术和交易平台电信业: Iliad, Vodafone Group 技术和交易平台区块链业: Anchorage, Bison Trails, Coinbase, Inc., Xapo Holdings Limited 技术和交易平台风险投资业: Andreessen Horowitz, Breakthrough Initiatives, Ribbit Capital, Thrive Capital, Union Square Ventures 技术和交易平台非营利组织、多边组织和学术机构: Creative Destruction Lab, Kiva, Mercy Corps, Women’s WorldBanking 技术和交易平台我们希望到 2020 年上半年针对性发布时，Libra 协会的创始人数量能够达到 100 个左右。 Facebook 团队与其他创始人合作，在 Libra 协会和 Libra 区块链的诞生中扮演了关键角色。Facebook 将保有领导 角色至 2019 年结束。当然，在 Libra，协会拥有最终决策权。Facebook 创立了受监管的子公司 Calibra，以确保社交 数据与金融数据相互分离，同时代表其在 Libra 网络中构建和运营服务。 一旦Libra 网络发布，Facebook 及其关联机构将与其他创始人享有相同的权利并承担相同的义务和财务责任。作 为众多成员中的一员，Facebook 会在协会管理方面承担与其他成员相同的职责。 区块链分为“许可型区块链”和“非许可型区块链”，这根据实体是否能作为验证者节点接入区块链平台来决定。在“ 许可型区块链”中，实体通过权限授予方式运行验证者节点。在“非许可型区块链”中，符合技术要求的任何实体都可 以运行验证者节点。从这个意义上说，Libra 将以许可型区块链的形式起步。 为了确保 Libra 真正开放，始终以符合用户最佳利益的方式运作，我们的目标是让 Libra 网络成为非许可型网络。 但挑战在于，我们认为目前还没有成熟的解决方案可以通过非许可型网络，提供支持全球数十亿人和交易所需的 规模、稳定性和安全性。协会的工作之一便是与社群合作，研究和实施从许可型向非许可型的过渡，过渡工作将在 Libra 区块链和生态系统公开发布后五年内开始。 无论是在许可型还是非许可型状态下，Libra 区块链都将向所有人开放:任何消费者、开发者或公司都可以使用 Libra 网络、在这个网络上构建产品，并通过他们的服务实现增值作用。这种开放性是 Libra 精神的本质。开放访问权限能 够确保较低的进入和创新门槛，并鼓励有利于消费者的良性竞争。这是实现以下目标的基础:为世界建立更普惠的 金融服务。 Libra 区块链Libra 区块链的目标是成为金融服务的坚实基础，包括打造一种新的全球货币，满足数十亿人的日常金融需求。通 过对现有方案的评估，我们决定基于下列三项要求构建一个新的区块链: 能够扩展到数十亿帐户，这要求区块链具有极高的交易吞吐量和低延迟等特点，并拥有一个高效且高容量 的存储系统。 高度安全可靠，可保障资金和金融数据的安全。 足够灵活，可支持 Libra 生态系统的管理以及未来金融服务领域的创新。 Libra 区块链就是为了全面满足这些要求，在现有项目和研究的基础上从头开始设计和构建而成的，集合了各种创 新方法和已被充分掌握的技术。下一节将重点介绍有关 Libra 区块链的三项决策: 1.设计和使用 Move 编程语言。2.使用拜占庭容错 (BFT) 共识机制。3.采用和迭代改善已广泛采用的区块链数据结构。 “Move”是一种新的编程语言，用于在 Libra 区块链中实现自定义交易逻辑和“智能合约”。由于 Libra 的目标是每天 为数十亿人服务，因此 Move 的设计首先考虑到安全性和可靠性。Move 是从迄今为止发生的与智能合约相关的安 全事件中吸取经验而创造的一种编程语言，能从本质上令人更加轻松地编写符合作者意图的代码，从而降低了出现 意外漏洞或安全事件的风险。具体而言，Move 从设计上可防止数字资产被复制。它使得将数字资产限制为与真实资 产具有相同属性的“资源类型”成为现实:每个资源只有唯一的所有者，资源只能花费一次，并限制创建新资源。Move 语言还便于自动验证交易是否满足特定属性，例如，仅更改付款人和收款人帐户余额的付款交易。通过优先实现这 些特性，Move 可帮助保持 Libra 区块链的安全性。通过减轻关键交易代码的开发难度，Move 可以可靠地执行 Libra 生态系统的管理政策，例如对 Libra 货币和验证者节点网络的管理。Move 将加快 Libra 区块链协议以及在此基础上 构建的任何金融创新的演变。我们预计将在一段时间后向开发者开放创建合约的权限，以支持 Move 的演变和验证。 Libra 区块链采用了基于 LibraBFT 共识协议的 BFT 机制来实现所有验证者节点就将要执行的交易及其执行顺序达 成一致。这种方法可以在网络中建立信任，因为即使某些验证者节点(最多三分之一的网络)被破坏或发生故障，BFT 共识协议的设计也能够确保网络正常运行。与其他一些区块链中使用的“工作量证明”机制相比，这类共识协议还可 实现高交易处理量、低延迟和更高能效的共识方法。 为了保障所存储的交易数据的安全，Libra 区块链中的数据受梅克尔树的保护，它是一种已在其他区块链中广泛使 用的数据结构，可以侦测到现有数据的任何变化。不同于以往的区块链都将区块链视为交易区块的集合，Libra 区块 链是一种单一的数据结构，可长期记录交易历史和状态。这种实现方式简化了访问区块链的应用程序的工作量，允 许它们从任何时间点读取任何数据，并使用统一框架验证该数据的完整性。 Libra 区块链遵循匿名原则，允许用户持有一个或多个与他们真实身份无关的地址。这是许多用户、开发者和监管 机构都熟悉的模式。Libra 协会将负责监督 Libra 区块链协议和网络的演变，并将继续评估可增强区块链隐私保护 的新技术，同时考虑它们的实用性、可扩展性和监管影响。 如需了解详情，请阅读有关Libra区块链的技 术 论 文 。也可查阅有关 Move编程语言和LibraBFT共识协议的详细信息。我们已经推出了 Libra 测试网的早期版本，并提供了配套文档。测试网仍处于开发阶段，API 可能会发生变化。我 们致力于开诚布公地与社群合作，因此希望您可以阅读相关内容、进行开发和提供反馈。 Libra 货币和储备我们认为，世界需要一种全球性的数字原生货币，它能够集世界上最佳货币的特征于一体:稳定性、低通货膨胀率、 全球普遍接受和可互换性。Libra 货币旨在帮助满足这些全球需求，以期扩展金钱对全球人民的影响。 Libra 的目标是成为一种稳定的数字加密货币，将全部使用真实资产储备(称为“Libra 储备”)作为担保，并由买卖 Libra 并存在竞争关系的交易平台网络提供支持。这意味着，任何持有 Libra 的人都可以获得高度保证，他们能够根 据汇率将自己持有的这种数字货币兑换为当地货币，就像在旅行时将一种货币换成另一种货币一样。这种方法类似 于过去引入其他货币的方式:确保这种货币可以用于换取真实资产，比如黄金。目的是为了帮助培养人们对新货币 的信任，并在货币诞生初期实现广泛使用。尽管Libra 不会使用黄金作为支持，但它将采用一系列低波动性资产(比 如，由稳定且信誉良好的中央银行提供的现金和政府证券)进行抵押。 必须要强调的是，这意味着一个 Libra 并不总是能够转换成等额的当地指定货币(即 Libra 并不与单一货币“挂钩” )。相反，随着标的资产的价值波动，以任何当地货币计价的 Libra 价值也可能会随之波动。然而，选择储备资产的目 的是最大限度减少波动性，让 Libra 的持有者信任该货币能够长期保值。Libra 储备中的资产将由分布在全球各地且 具有投资级信用评价的托管机构持有，以确保资产的安全性和分散性。 Libra 背后的资产是它与许多现有加密货币之间的主要差异，这些加密货币缺乏这种内在价值，因此价格会因心理 期望而大幅波动。然而，Libra 的确是一种加密货币，因此，它继承了这些新型数字货币的几个引人注目的特性:能 够快速转账，通过加密保障安全性以及轻松自由地跨境转移资金。正如当今世界人们可以随时随地使用手机向好 友发送消息一样，我们同样可以通过 Libra 即时、安全且经济地管理资金。 储备资产的利息将用于支付系统的成本、确保低交易费用、分红给生态系统启动初期的投资者(前往此处阅读“Libra 协会”相关内容)，以及为进一步增长和普及提供支持。储备资产的利息分配将提前设定，并将接受 Libra 协会监 督。Libra 用户不会收到来自储备资产的回报。 有关储备政策和 Libra 货币的详情，请参阅此处。 Libra 协会Libra 的使命是建立一套简单的、无国界的货币和为数十亿人服务的金融基础设施。为了实现这一使命，Libra 区块链和 Libra 储备需要一个由多元化的独立成员构成的监管实体。这个监管实体就是 Libra 协会，一家独立的非营利性会员制组织，总部位于瑞士日内瓦。瑞士一直以来都持全球中立立场，并对区块链技术持开放性态度，而 Libra 协会也力求成为一家中立的国际性机构，因此在瑞士注册是理所当然的选择。Libra 协会旨在促进 Libra 区块链的运营；协调各个利益相关方（网络的验证者节点）在推广、发展和扩张网络的过程中达成一致；以及管理储备资产。 Libra 协会由 Libra 协会理事会管理，理事会由各验证者节点各指派一名代表构成。理事会成员共同对网络和储备的治理制定决策。在初始阶段，这一群体由作为 创始人的全球企业、非营利组织、多边组织和学术机构组成。所有决策都将通过理事会做出，重大政策或技术性决策需要三分之二的成员投票表决同意，即 BFT 共识协议中所要求的绝对多数网络成员。 通过协会，验证者节点得以与网络的技术方案和发展目标保持一致。在这方面，协会类似于其他非营利性实体，通常以基金会的形式出现，管理开源项目。由于 Libra 未来的发展依赖于一个分散的、不断成长的开源贡献者社群，因此协会是一个必要的媒介，就开发和采用什么样的协议或规范给予引导。 Libra 协会还是一个负责管理 Libra 储备的实体，因此掌控着 Libra 经济的稳定和成长。只有 Libra 协会能够制造 (mint) 和销毁 (burn) Libra。只有当授权经销商投入法定资产从协会买入 Libra 币以完全支持新币时，Libra 币才会被制造。只有当授权经销商向协会卖出 Libra 币以换取抵押资产时，Libra 币才会被销毁。由于授权经销商始终能够将 Libra 币以等于篮子价值的价格卖给储备，因此 Libra 储备承担着“最后的买家”的角色。 Libra 协会的这些活动受 储备管理政策 的监管和约束，该政策只能在绝对多数协会成员同意的情况下进行更改。 在该网络发展的最初几年，需要额外依靠一些角色来替协会完成下列工作：招募担当验证者节点的创始人；为快速启动生态系统而进行筹款；设计和实施激励计划，从而推动 Libra 被广泛采用，包括向创始人发放此类激励奖金；以协会名义建立社会影响力资助计划。 协会的一个额外目标是开发和推广一种开放性身份标准。我们认为，分散而便携的数字身份是实现金融普惠和竞争的先决条件。 Libra 协会的一个重要目标就是逐步提高分散化的程度。这种去中心化有助于降低网络构建和使用的进入门槛，而且从长远来看，它也有助于提高 Libra 生态系统的弹性。如上文所述，协会将逐步实现 Libra 网络的非许可型管理和共识。协会将力求在五年内启动这一过渡，并以此逐渐减少对创始人的依赖。同样地，作为 Libra 储备的管理者，Libra 协会也会力争最大程度降低对自身的依赖。 如需详细了解 Libra 协会，请参阅此处。 Libra 下一步的计划是什么？今天，我们将发布此文档来概述有关 Libra 的目标，并推出 libra.org 作为协会和所有 Libra 事务的信息发布主页。 该站点将在未来几个月内持续发布更新。我们还开放了 Libra 区块链的源代码并推出 Libra 的初始测试网，供开发 者尝试并在此基础上进行开发。 预定的针对性发布日期为 2020 年上半年，而在此之前，我们还有大量工作要做。 Libra区块链: 在未来几个月内，协会将收集社群关于Libra区块链原型的反馈，然后进入生产就绪阶段。特别要说明的是，这项工作将侧重于确保协议和实现的安全性、性能和可扩展性。 Libra协会将构建有据可查的API和库，实现用户与Libra区块链之间的互动。 Libra协会将使用开源方法为Libra区块链背后的协同技术开发创建框架。我们将建立适当的程序，用于讨论和审核针对区块链底层协议和软件的更改。 协会将对区块链执行广泛的测试，从对协议的测试到联合各家实体(如钱包服务和交易平台)对网络进行整体测试，从而确保系统在发布前运转正常。 协会将努力促进Move语言的发展，并且在Libra生态系统发布之后，一旦Move语言发展趋于稳定，我们将为第三方创建智能合约确立相应路径。 协会将与社群一起，在通往非许可型生态系统的道路上攻克技术难题，力争实现我们在发布后 五年内开始过渡的目标。 储备: 协会将为储备设立监管小组，成员由分布在各地且受到监管的全球机构托管人组成。 协会将为储备建立运营程序，以便与授权经销商进行交易，并确保高透明度和可审计性。 协会将制定适当的政策和程序，以规范协会更改储备篮子组成的方式。 Libra协会: 我们将扩充Libra协会理事会，使其包含大约100名分布在各地的多元化成员，所有成员均担当Libra区 块链的初始验证者节点。 我们将在目前提出的治理结构的基础上，为协会制定一份全面的章程和一系列细则并予以采用。 我们将为协会招募一名常务董事，并与此人一起继续组建协会的执行团队。 我们将选定与我们肩负共同使命的社会影响力合作伙伴，并与他们合作建立社会影响力咨询委 员会和制定社会影响力计划。 如何参与协会希望打造一个充满活力的生态系统，供开发者构建应用和服务，从而鼓励世界各地的人们使用 Libra。协会认为， 如果这个系统能让世界上任何个人或公司以公平实惠的方式即时支取自己的资金，它就是成功的。例如，成功将意 味着，在国外工作的人可以通过一种方便快捷的方式将钱汇回家，而大学生则可以像买咖啡一样轻松地支付房租。 我们的征途才刚刚开始，需要寻求社群的帮助。如果您相信 Libra 能够为全球数十亿人服务，请分享您的观点并加 入我们。为了让金融普惠在世界各地成为现实，您的反馈意见不可或缺。 如果您是一名研究人员或协议开发者，您可以提前预览 Libra 测试网(根据 Apache 2.0 开源许可发布)和配套 文档。这个流程才刚刚启动，测试网还是一个开发中的早期原型，但您可以立即读取相关内容、进行开发和提 供反馈。由于目前的重点是保持原型的稳定性，项目进度最初可能会偏慢，以便我们采纳社群的意见。但是，我 们致力于建立一个面向社群的开发流程，并从合并请求开始，尽快向开发者开放此平台。如果您想了解 Libra 协会，请前往此处查看详情。如果您的组织有意成为创始成员或申请向 Libra 协会捐赠社会影响力资助，请前往此处查看详情。 在未来几个月，协会将与全球社群合作，并继续与世界各地的决策者携手，推动实现这一使命。 结语Libra 的目标如下:在安全稳定的开源区块链基础上创建一种稳定的货币，该货币以真实资产储备为后盾，并由独 立协会管理。 我们希望创造更完善、更实惠的开放式金融服务，人们不论身份、不论地域、不论职业、不论贫富，均可享受这种服 务。我们深知，要实现这样的愿景将需要长久的艰辛努力，并且绝非一己之力可以完成，这将需要大家同心协力、脚 踏实地地向前迈进。希望您能加入我们，协助我们将这一梦想变成现实，造福全球数十亿人。 1Best Buy.”AT&amp;T prepaid Alcatel CAMEOX device purchase.” Bestbuy.com.网址：https://www.bestbuy.com/site/at-t-prepaid-alcatel-cameox-4g-lte-with-16gb-memory-cell-phone-arctic-white/6008102.p?skuId=6008102（访问日期：2019 年 5 月 15 日）。 2A.Demirgüç-Kunt, L. Klapper, D. Singer, S. Ansar, and J. Hess.The Global Findex database 2017:Measuring financial inclusion and the fintech revolution.World Bank Group, 2018.访问日期：2019 年 5 月 15 日。Globalfindex.worldbank.org. [Online].网址：https://globalfindex.worldbank.org/sites/globalfindex/files/2018-04/2017%20Findex%20full%20report_0.pdf 3OECD.Mobile phones:Pricing structures and trends.Paris, France:OECD Publishing, 2000, p. 67. [Online].网址：https://books.google.com/books?id=pcP84M_GBeoC&amp;pg=PA6&amp;lpg=PA6&amp;dq=1999+price+SMS+europe&amp; source=bl&amp;ots=TIbwgZWCmj&amp;sig=ACfU3U2Z_yRawxW78qVSVO_wHCtRupoqoA&amp;hl=en&amp;sa=X&amp;ved=2ahUKEwjOmeG9tMHiAhVVFzQIHU8e BEMQ6AEwD3oECAkQAQ#v=onepage&amp;q =SMS&amp;f=false 4Consumer Federation of America.”How payday loans work.” Payday Loan Consumer Information.网址： https://paydayloaninfo.org/facts（访问日期：2019 年 5 月 19 日）。 5A.Demirgüç-Kunt, L. Klapper, D. Singer, S. Ansar, and J. Hess.The Global Findex database 2017:Measuring financial inclusion and the fintech revolution.World Bank Group, 2018.访问日期：2019 年 5 月 15 日。Globalfindex.worldbank.org. [Online].网址：https://globalfindex.worldbank.org/sites/globalfindex/files/2018-04/2017%20Findex%20full%20report_0.pdf","categories":[],"tags":[{"name":"Facebook","slug":"Facebook","permalink":"http://www.liantianhua.com/myblog/tags/Facebook/"},{"name":"区块链","slug":"区块链","permalink":"http://www.liantianhua.com/myblog/tags/区块链/"},{"name":"虚拟货币","slug":"虚拟货币","permalink":"http://www.liantianhua.com/myblog/tags/虚拟货币/"}]},{"title":"初学者的热情","slug":"初学者的热情","date":"2019-04-30T15:02:36.000Z","updated":"2019-04-30T15:32:38.944Z","comments":true,"path":"2019/04/30/初学者的热情/","link":"","permalink":"http://www.liantianhua.com/myblog/2019/04/30/初学者的热情/","excerpt":"深圳的夏天在四月份就提前到来了，天气闷热，不想打篮球、不想跑步、不想健身。这阵子工作压力相对较小，可以在六点一刻下班，正好今年年初的时候给自己定了其中一个小目标-学游泳，小时候还是比较怕水的…….","text":"深圳的夏天在四月份就提前到来了，天气闷热，不想打篮球、不想跑步、不想健身。这阵子工作压力相对较小，可以在六点一刻下班，正好今年年初的时候给自己定了其中一个小目标-学游泳，小时候还是比较怕水的……. 记录一下这玩意就当做纪念一下，下水作业了吧。 4月27日，周六，中午狂风暴雨，傍晚晚霞迷人，第一次来宝体，三个人（两个很厉害的同事带飞），下水成功。 4月28日，周天，五一调休要上班，下班之后自己去了，熟悉水性…….不会游泳还占用一条泳道有点羞耻啊哈哈哈哈 4月29日，星期一，渐渐开始享受一个人去游泳，享受一个人路上走走停停…….这一天能漂浮了，25米要停下来换气三次，还不会换气，自己练蛙泳腿，也就是这天，开始不怕水了…… 4月30日，今天是四月的最后一天，练习过程中换气，哇，一换之后身体就往下沉，心态爆炸啊哈哈哈哈，换气还得继续练,不过水性好了，下水不需要适应几分钟了 争取半个月之后能一次性游25X2，先学蛙泳，然后自由泳、蝶泳、仰泳、、、、、 基于初学者的热情，办了张游泳卡，一次十五块，值。回家还能省烧水的电费……","categories":[],"tags":[{"name":"兴趣","slug":"兴趣","permalink":"http://www.liantianhua.com/myblog/tags/兴趣/"},{"name":"划水","slug":"划水","permalink":"http://www.liantianhua.com/myblog/tags/划水/"},{"name":"运动","slug":"运动","permalink":"http://www.liantianhua.com/myblog/tags/运动/"}]},{"title":"谁在孕育此物","slug":"谁在孕育此物","date":"2019-04-25T16:35:24.000Z","updated":"2019-04-25T17:14:57.559Z","comments":true,"path":"2019/04/26/谁在孕育此物/","link":"","permalink":"http://www.liantianhua.com/myblog/2019/04/26/谁在孕育此物/","excerpt":"夜深人静，方是写东西的时间，此刻是深圳时间2019年4月26日凌晨十二点半，天气热，月色好，肚子饿…….","text":"夜深人静，方是写东西的时间，此刻是深圳时间2019年4月26日凌晨十二点半，天气热，月色好，肚子饿……. 互联网产品的通常是挖掘用户的场景和痛点需求，通过某种方式解决用户的痛点满足用户，然后全力给用户一个最好的体验，让用户可以用的舒服从而产生粘性留在产品上，在乎的是数据，例如用户数量、使用时间、使用频次、活跃用户等数据。虽然现在从事的是硬件产品管理相关的工作，但个人感觉硬件产品与软件产品的孕育过程似乎逻辑上也是相同的，只不过硬件产品的周期更长、参与的人员群体更多、用户的体验成本也相对较高（毕竟硬件买回来试试的成本比软件下载试试成本更高）。夜深了，那我就借着这月色YY一次一个软件APP的孕育过程。 APP产品的孕育播种一般情况来说，要孕育一个app肯定是有某种背景的，没人愿意做没有目的而且可能亏本的生意。这种背景可能产生于公司/团队的战略背景、业务调增补充、某个有利可图的用户需求、亦或是像大学时候我的推荐算法老师卫博士说的一样为人类的文明进步而创造的情怀，这个时候就为APP的孕育创造了时机。 APP开发的一般过程及分工 怎么玩？产品经理产品经理就是在整个产品生产过程中，从功能策划到用户反馈都需要负责的人，是要负责负责人的哟，所以他除了要有基本的产品基本工和职业素养，最重要的是要非常善于沟通，因为可能随时被怼。常用的工具有Office\\Xmind\\Axure\\Sketch\\墨刀等，输出各种文档，主要的工作责任如下： 市场分析：发现并掌握目标市场和用户需求的变化趋势，对未来几年市场上需要什么样的产品和服务做出预测。 用户研究：通过定性（用户访谈）、定量（调查问卷）等分析方法对用户需求进行挖掘和分析。 竞品分析：收集竞争对手的资料、试用竞争对手的产品，从而了解竞争对手产品，有时候没灵感的时候可能需要取长补短。 产品规划：确定目标市场、产品定位、发展规划及路线图。 需求管理：对来自市场、用户等各方面的需求进行收集、汇总、分析、更新、跟踪。 需求确认：组织协调各大部门、研发等部门，对需求进行评估及确认开发周期。 产品设计：编写产品需求文档，包括业务结构及流程、界面原型、页面要素描述等内容。 版本管理：维护产品的每个版本的功能列表。…………….. 游戏规则产品经理在做好需求分析之后，需要通过自己动手设计产品原型界面，初期用于交流的话可能草图或者低保真即可，能力强有时间的话就来高保真的（可能加分可能挨骂哈哈哈）。这些工作都完成之后，需要去找设计小哥哥小姐姐聊啊，主要出于两个方面：一是让设计师了解业务逻辑及需求，二是给设计人员预留思考缓冲时间好安排工作，毕竟设计师是需要灵感激发的，然后把相关的文档给到位。 然后接下来就是多次开会，上图各个流程的主要人员基本都是要参加的，需求评审，确认可行性(技术可行？技术难度？)、确认开发周期、人员安排到位、项目立项………各司其职，开干……. 角色扮演1.产品经理主要是沟通、协调、出方案、把控项目进度和质量，适时提提建议，不可从冲动就对了。 2.UI设计师借助Adobe全家桶、C4D等工具，从产品需求入手，考虑产品到底要用什么主色调、配色和辅助色用什么颜色、用什么风格来表达、图标化成什么风格、如何表达情感化设计、动效如何做、图标icon怎么搞好、适配、切图等。产品经理要及时跟进沟通，要负责的…… 3.程序员要考虑的是业务的数据库怎么构造，用什么技术方案，相关模块的开发等，包括前端后端客户端的全套服务…… 4.测试工程师要根据产品原型图去写好测试用例，研发人员做完某个功能就进行功能测试，等所有东西开发完成就搞联动测试。 5.运营小哥哥小姐姐：上线应用之后，就开始养产品养用户了。 产品运营：通过一系列各式各样的运营手段（比如活动策划、内外部资源拓展和对接、优化产品方案、内容组织等），去拉升某个产品的特定数据，如装机量、注册量、用户访问深度、用户访问频次、用户关系对数量、发帖量等。 内容运营：围绕着内容的生产和消费搭建起来一个良性循环，持续提升各类跟内容相关的数据，如内容数量、内容浏览量、内容互动数、内容传播数等。 用户运营：围绕着用户的新增—留存—活跃—传播以及用户之间的价值供给关系建立起来一个良性的循环，持续提升各类跟用户有关的数据，如用户数、活跃用户数、精英用户数、用户停留时间等。 活动运营：围绕着一个或一系列活动的策划、资源确认、宣传推广、效果评估等一系列流程做好全流程的项目推进、进度管理和执行落地。一个活动运营，必须事先明确活动的目标，并持续跟踪活动过程中的相关数据，做好活动效果的评估。 周期循环运营、产品、设计、开发、测试等在产品上线之后，如果是To C 的话还要不断关注数据、优化迭代、小步快跑、周期循环…… 真是饿了……","categories":[],"tags":[{"name":"APP","slug":"APP","permalink":"http://www.liantianhua.com/myblog/tags/APP/"},{"name":"深夜YY系列","slug":"深夜YY系列","permalink":"http://www.liantianhua.com/myblog/tags/深夜YY系列/"},{"name":"互联网","slug":"互联网","permalink":"http://www.liantianhua.com/myblog/tags/互联网/"}]},{"title":"CCBN2019 布展工作复盘","slug":"CCBN2019-布展工作复盘","date":"2019-03-30T14:35:07.000Z","updated":"2019-03-30T15:04:53.203Z","comments":true,"path":"2019/03/30/CCBN2019-布展工作复盘/","link":"","permalink":"http://www.liantianhua.com/myblog/2019/03/30/CCBN2019-布展工作复盘/","excerpt":"以前虽然去看过很多展会诸如车展，画展，摄影展，直到CCBN2019才第一次以参展商的第一视角参与其中。趁着从北京带回来的感冒还没完全好，复盘一下整个布展工作。2019年3月21日，以“融合引领视界 智慧连接未来”为主题的第二十七届中国国际广播电视信息网络展览会（简称CCBN2019）在北京中国国际展览中心正式开幕，于3月23日圆满落幕。","text":"以前虽然去看过很多展会诸如车展，画展，摄影展，直到CCBN2019才第一次以参展商的第一视角参与其中。趁着从北京带回来的感冒还没完全好，复盘一下整个布展工作。2019年3月21日，以“融合引领视界 智慧连接未来”为主题的第二十七届中国国际广播电视信息网络展览会（简称CCBN2019）在北京中国国际展览中心正式开幕，于3月23日圆满落幕。 CCBN2019介绍2019年3月21日-23日，以“融合引领视界 智慧连接未来”为主题的第二十七届中国国际广播电视信息网络展览会（简称CCBN2019）在北京中国国际展览中心正式开幕。经过27年的长足发展，作为广电全行业年度盛会，本届CCBN将对2019年广播电视科技创新发展和行业趋势动态进行全面展示，激发创新智慧、凝聚行业力量，多方位、多角度呈现我国广播电视科技领域取得的创新成果，以及我国广播电视事业产业发展的创新趋势和开创性局面。 参展准备工作 参展评估考虑经济价值、公司资金状况、新产品研发情况、告诉客户及同行还活着。 租用参展用地从需求考虑展台面积，沟通好单位面积价格以及附赠业务（如：赠送会刊单页广告、BDF主题报告会门票、展会期间午餐券等）。确定好相关事宜之后，需要签订展位用地租用合同，双方签字盖章存档 。 联系展台设计提供商在选择展台设计及搭建供应商的时候，选择以前合作过的具备专业能力的供应商，方便后期沟通及减少不必要的麻烦。同样的，需要事先给出几个选择方案，方便评估总体展台设计及搭建价格，同时方便我方对整体的方案有个大体的感觉。最后要对方给出报价单，以方便核对价格及后期工作物料检查。最后评估价格，制定验收标准，确定付款方式，签订合同。确定双方项目负责人的联系方式，方便后期沟通。 跨部门沟通参展需求信息网络：一般就是现有的机顶盒如：OTT盒子、直播星STB、IPTV盒子、PON系列产品等，具体的参展设备一般由周总及邱总确定，信息网络这部分一般问题不大，主要考虑怎么展（静态展示or动态展示），是否需要卫星信号、以太网、无线网络。具有还需要更加详细的沟通。成都应急广播研发中心：一般是大屏展示应急广播管理系统平台，控制台、服务器、硬件设备，音柱及喇叭等。这部分要考虑网络，大屏连接，操作间的空间大小是否满足要求，最好能让成都研发中心给出布线图或设备摆放草图。具有还需要更加详细的沟通。东莞航康物联网：城市级物联网系统平台一般是通过大屏展示，与前端的数据采集及感知设备联动展示。很多小的物联网配件则是静态展示，摆在桌面上，则要考虑画面整体的简约美感。要沟通清楚是否需要网络，参展设备的物品摆放草图。具有还需要更加详细深入的沟通。 确认参展需求这是一个漫长的沟通过程，主要对接各业务单元的负责人以及相关领导，确认、优化产品参展策略。最重要的是需要关注细节，如设备的名称、大小、数量、用电用网情况，设备是否有授权有侵权情况，最好能有文档记录下来，条理清晰，一幕了然。沟通的过程容易产生分歧，需要保持耐心，保持心态稳定。 CCBN官网填写相关信息（注意时间节点）在CCBN展位官网上按照步骤依次填写即可，填写参展人员的时候可多写10个以备后期参展期间紧急使用。这部分工作要严格在对应的时间节点完成，以免耽误。参展商的纸质文件一般是开展前由组委会统一邮寄到负责人处，收到后要清点物资数量，一般包括参展商参展证，BDF主题报告会邀请函，会场门票，展会期间午餐券。填写CCBN官网参展商信息的时候，最重要的事情是要核对这个时间节点！！！时间节点！！！ 与展台设计供应商确定展台展示方案首要关心展馆的安全系数，是否满足安全要求，如材料的稳固系数，柱子之间的跨度，横梁的安全系数。根据参展设备及公司主题色，结合领导一间敲定展台样式及效果。 多方沟通改进参展需求、改进展台设计方案根据与各业务单元的负责人沟通结果，反馈至设计负责人处。注重展品的一些展示方式，特别是细节上的沟通尤为关键，细节更加容易让人忽略。整个沟通改进过程需要花费很长的周期，需要主动及时跟进项目进度。 展会宣传资料、产品资料收集、广告文案编写、审核该项任务前期需要根据参展产品及公司业务来收集文字图片资料，灯箱广告的文案需要根据公司的业务结合当前行业的主流风口编写，后期可与领导及公设计人员沟通取舍改进。 启动宣传资料、视频设计工作最重要的事情是要避免字体版权问题及图片版权问题，这个问题很关键，不然被告侵权的话就麻烦了。因为公司平面设计人员数量相对来说较少，该项工作需要提前三个月进行（大概是12月中下旬开始），开始前需要制定具体的时间轴，确保良好的进度，从过去的几年来看，经常是非常赶的。纸质宣传资料的的类型，数量要确定，避免缺漏情况。视频由于需要耗费大量的人力财力，一般上来说不会每年全部更新，只有部分进行更新。该项任务的要点是要在制定的时间节点上完成100%正确性的宣传资料，讲究准确性及时效性的同时，也要加强与设计人员的沟通，及时跟进需求变更及任务进度。 参展人数、参展服装确定参展人员数量由领导来定，确定各事业部的参加人数。参展服装可采用问卷来采集，导出更加方便。人数的确定要尽快确定，影响到后期的机票预定及酒店预定工作。 参展人员行程及住宿问题（确定行程、预定机票、预定酒店、预定会议室）通知相关人员（邮件或者微信知会相关信息如时间、地点、线路等）。酒店要提前预定，不然后期产生更多的费用支出。要在开展前的连两个月确定该项工作，布展人员可提前约定展馆附近的酒店。行程及航班信息可采用问卷的方式采集，更加快捷高效。 展台效果图、施工图确认展台效果图，施工图，可微信群讨论最后版本的图。完成之后让展台搭建方尽快按照施工图在规定的时间节点上完成报馆流程，施工用电及展台用电申请。 宣传页H5（邀请函等），转发给相关人员。H5宣传页主要包括以下信息：公司业务介绍，参展产品介绍，展会开展时间地点、联系方式以及邀请信息。这项任务一般要从开展前20天完成，一般为2月25日左右完成，完成后先自行审核，然后领导审核。至于怎么制作，尽可能自行设计，第三方设计是要花不少钱的。 展会零散物资准备该项任务因为需要涉及到较多的细节，建议列清单、可参考往年经验及展台实际需求。该项任务的时间节点大概要提前2-3周开始。如需要电视租用，请提前与北京康佳分公司沟通。 参展设备找相关负责人收集、设备测试确定参展设备之后，第一次邮件所有设备对应负责人。在开展前一个月再次邮件责任人，最后提前两周收集参展设备。测试设备各项功能是否正常。 宣传资料打样、打成品、物流到北京提前三周进行打样，然后审核资料的正确性。提前两周打印成品，因为打印工作正常情况需要一周时间完成。提前一周联系物流（一般使用公司通用物流-联系高经理），预留好物流时间发货北京，注意3月份两会期间对物流产生的影响。提前联系好在北京接货的人员，一般为酒店的前台。 零散物料寄送北京物资出康佳研发大厦需要在EIP上提放行条的申请，需要提前提流程。预留好物流时间发货北京，注意3月份两会期间对物流产生的影响。提前联系好在北京接货的人员，一般为酒店的前台。 展前沟通会议展前沟通会要确定到北京后的人员安排，工作计划，注意事项，时间节点等提前存好各项电子资料，联系人联系方式，以备不时之需。主题报告会、技术分享会议、纸质参展资料等告知有需要的人员，部门人员的统一在北京发放，到京后要去清点确认物资的完整性。 布展现场 布展第一天提前到场进行电视信号线、网线的暗线布线工作。（存好现场各负责人的联系方式（手机、微信等））。 注意电位及排插的位置是否合理，布线要走暗线，不然影响美观。 第二天联系借电视的负责人（租借放、运输方、安装方）。 然后跟进布展进度，确保第三天能进行设备调试工作。 布展第三天开始调试设备、宣传资料装袋子、展台细节整改（如：接缝、灯箱字体、灯光效果、排查电位是否到位、搭建方提供物料检查是否齐全等）。 布展第三天18：00设备前全部要求调试完毕。 细节检查，要及时记录，及时推进。 开展时间 产品讲解人员安排 接待室的茶水、咖啡供应情况检测、垃圾及时处理，保持接待室干净整洁。 控制宣传资料发放的量，基本是第一天就发放了80%的资料，剩下第第二天、第三天各10%，同时留10份紧急情况备用。 展会期间注意使用展会提供的用餐券统一提取午餐并安排给相关人员 展会期间注意保存U盘、遥控器、钥匙等物资 展会期间注意拍照，存好照片，可用于宣传资料的工作。 撤展时间 提前开具参展物料出馆放行条 提前安排撤展工作（撤展人员、撤展时间节点） 清点撤展物资，提前预约快递人员 考虑堵车问题，展馆附近开展撤展很堵 展后复盘工作 参展设备归还相关人员 整理相关文档资料（照片、布展文档） 输出复盘文件 完成尾部工作（如付款、报销等） 如果有重大新闻可编写新闻稿子用于宣传","categories":[],"tags":[{"name":"工作","slug":"工作","permalink":"http://www.liantianhua.com/myblog/tags/工作/"},{"name":"CCBN","slug":"CCBN","permalink":"http://www.liantianhua.com/myblog/tags/CCBN/"},{"name":"展会","slug":"展会","permalink":"http://www.liantianhua.com/myblog/tags/展会/"}]},{"title":"“读书会-《即兴演讲》”","slug":"“读书会-《即兴演讲》”","date":"2018-08-22T12:24:42.000Z","updated":"2018-09-08T13:13:37.010Z","comments":true,"path":"2018/08/22/“读书会-《即兴演讲》”/","link":"","permalink":"http://www.liantianhua.com/myblog/2018/08/22/“读书会-《即兴演讲》”/","excerpt":"又到我司的读书会时间，非常不错的活动。谈到即兴演讲，大多数人都认为是临场发挥，但是读完这本书后，彻底改观，所谓的即兴就是一切准备妥当，不是不经思考地脱口而出，它和准备正式讲话一样，需要技巧也需要练习。即使是演说家丘吉尔做即兴演讲都要准备好稿子，台下再三的练习。所谓即兴演讲更多的是即兴交流，每一次交流的瞬间，都是在表达自己输出观点的一个机会。简短的时间里，我们能够清晰地表达自己的观点，尤其重要。这本书三观很正，它是想告诉你要想成为一个即兴，一个能够散发领导力的人，你得首先改变你自己，自己在心态上，在你准备过程中，有没有做好领导者的准备。","text":"又到我司的读书会时间，非常不错的活动。谈到即兴演讲，大多数人都认为是临场发挥，但是读完这本书后，彻底改观，所谓的即兴就是一切准备妥当，不是不经思考地脱口而出，它和准备正式讲话一样，需要技巧也需要练习。即使是演说家丘吉尔做即兴演讲都要准备好稿子，台下再三的练习。所谓即兴演讲更多的是即兴交流，每一次交流的瞬间，都是在表达自己输出观点的一个机会。简短的时间里，我们能够清晰地表达自己的观点，尤其重要。这本书三观很正，它是想告诉你要想成为一个即兴，一个能够散发领导力的人，你得首先改变你自己，自己在心态上，在你准备过程中，有没有做好领导者的准备。 有场景樊登读书会的视频一开始，读书会的樊登老师说道，这本书应该叫《即兴交流》更优于叫《即兴演讲》。之所以要这么说，主要是源于我们大部分人的日常生活与工作中大部分场景是交流场景，只有特别少的一部分场景是属于真正的演讲。这本书的应用也非常适用于日常的交流，包括你走进电梯，抬头看见领导，共同度过电梯里的几秒或十几秒钟。每周的几十分钟工作汇报，会议桌坐着你的各位同事。周末跟好友相约几个小时的侃大山，大家谈工作谈生活。所以，我们应该时刻以一种演讲者的心态去沟通交流，有准备有风趣有自信有逻辑有重点去表达自己的想法，同时也要善于倾听。 有套路按照《即兴演讲》这本书给我们的观点。一个普通的人，经过刻意的即兴演讲练习，也可以完美地来一场即兴演讲，掌控人生的关键时刻。这本书认为，所谓即兴演讲，并不是我们印象中的口若悬河地讲个不停，而是有节奏、有计划地让听众接受到你的观点并产生行动动力的过程，是有规律的，并且这规律是可以被一般人通过刻意练习所掌握的。樊登举例了丘吉尔、小马丁路德金。他们通过刻意练习，最后成为了一名全世界知名的演讲家。尽管可能大多优秀的演讲者都看似轻松，但其背后都有着一定的套路和刻意的联系。毫不夸张地说，即兴演讲和遗传关系不大，而是套路使用和刻意练习所结合的产物。《即兴演讲》会是又一个带给你改变的利器。书中提供的套路包括四步：抓手、要点、结构和呼吁。 第一步是抓手其目的是为了吸引听众。在注意力稀缺的时代，无论是和同事、老板还是和朋友说话，在开口的瞬间就要吸引住他们，不然很可能你说话就没人会听了。我们可以用直呼对方的名字、说一些关于他们的事情、讲他们曾经提出过的某个观点等方式抓住对方的注意力。 第二步是陈述要点这一部分是即兴演讲的核心。如果讲话没有要点，讲话就变成了信息的堆砌，听众完全搞不懂你在讲什么。可能你在一脸陶醉地自嗨，而听众早已一脸懵逼的耸耸肩玩手机去了。要点必须是你的观点，是你将你的想法凝练成的一句简单、清晰、明确的一句话。 第三步是建立结构体目的是为讲话要点构建令人信服的案例，并提供明确的、有说服力的论据。要知道，仅仅陈述要点是不够的，还需要提供论据鼓励听众信服我们提出的观点。而建立结构体就是说要以一种清晰明了的形式展现支撑要点的论据。这本书中，作者为我们提供了原因模式、方法模式、情况/反应模式、时间顺序模式等四种模式以供我们建立结构体的时候参考。 第四步是以呼吁行动结束其目的是为了在此吸引观众并把讲话要点具体化，将一个抽象观点转变为若干的行动步骤。这一部分通常要求听众对讲话要点采取行动，也可以代表听众介绍你打算采取的行动，或者概述大家共同采取的一些协同行动。 有实践一场优秀的即兴交流或者演讲一定是套路使用和刻意练习的有机结合，知之不若行之，学至于行之而止矣。我们可以把握电梯或者茶水间的几十秒，早会的几分钟，酒会活动的几个小时以及至关重要的正式演讲，慢慢实践并积累经验。有场景、有套路、有实践的演讲理论及技巧，一定会让读者慢慢成为优秀的演讲者。 推荐链接一图简读《即兴演讲》@猫妮制图","categories":[{"name":"读书","slug":"读书","permalink":"http://www.liantianhua.com/myblog/categories/读书/"}],"tags":[{"name":"读书","slug":"读书","permalink":"http://www.liantianhua.com/myblog/tags/读书/"},{"name":"演讲","slug":"演讲","permalink":"http://www.liantianhua.com/myblog/tags/演讲/"},{"name":"技巧","slug":"技巧","permalink":"http://www.liantianhua.com/myblog/tags/技巧/"}]},{"title":"Python Imaging Library 图片拼接","slug":"Python-Imaging-Library-图片拼接","date":"2018-08-19T12:47:11.000Z","updated":"2018-09-08T13:10:51.500Z","comments":true,"path":"2018/08/19/Python-Imaging-Library-图片拼接/","link":"","permalink":"http://www.liantianhua.com/myblog/2018/08/19/Python-Imaging-Library-图片拼接/","excerpt":"好多人可能见过如下图的图片，将几百张图片合成一张。前几天在上班的地铁上看到一张将所有好友微信头像合成一张大图的朋友圈图，我也想折腾一下，第一个想起的工具是Python咯。PIL：Python Imaging Library，已经是Python平台事实上的图像处理标准库了，PIL功能非常强大。","text":"好多人可能见过如下图的图片，将几百张图片合成一张。前几天在上班的地铁上看到一张将所有好友微信头像合成一张大图的朋友圈图，我也想折腾一下，第一个想起的工具是Python咯。PIL：Python Imaging Library，已经是Python平台事实上的图像处理标准库了，PIL功能非常强大。 图片准备 话不多数，直接上代码。 上代码1234567891011121314151617181920212223242526272829303132333435363738394041424344454647import PIL.Image as Imageimport osimport math# 初始化图片地址列表pathList = []# 文件夹地址，根据自己的文件路径设置headImgPath = '/Users/liangtianhua/Desktop/images/'# 遍历图片地址并依次添加到Listfor item in os.listdir(headImgPath): imgPath = os.path.join(headImgPath, item) pathList.append(imgPath)#print(pathList)# 计算文件夹中图片的数量（List的长度）total = len(pathList)print('文件夹中一共有 ',total,' 张照片')# 计算新图片的行数与单行个数line = int(math.sqrt(total)) + 1# new一个合适的RGB通道，大小为（xx,yy）的图片NewImage = Image.new('RGB', (128*line,128*line))x = y = 0for item in pathList: try: img = Image.open(item) # Image.ANTIALIAS：平滑滤波。对所有可以影响输出像素的输入像素进行高质量的重采样滤波，以计算输出像素值。 img = img.resize((128,128),Image.ANTIALIAS) # 将读取的照片粘贴在新的大照片，像素点依次对齐 NewImage.paste(img, (x * 128 , y * 128)) x += 1 except IOError: print('第%d行,%d列文件读取失败！IOError:%s' % (y,x,item)) print('试试在你的mac终端运行：sudo find ./ -name \".DS_Store\" -depth -exec rm &#123;&#125; \\;') x -= 1 # 换行处理 if x == line: x = 0 y += 1#print(line,x,y,x+line*y,line*line)# 输出最后合成的照片NewImage.save(\"Final.jpg\")print('照片输出完毕！') 图片输出 PIL扩展PIL 更多使用技巧可以参考廖雪峰的官方网站学python以及官方API手册 Python Imaging Library Handbook","categories":[{"name":"python","slug":"python","permalink":"http://www.liantianhua.com/myblog/categories/python/"}],"tags":[{"name":"微信","slug":"微信","permalink":"http://www.liantianhua.com/myblog/tags/微信/"},{"name":"图片拼接","slug":"图片拼接","permalink":"http://www.liantianhua.com/myblog/tags/图片拼接/"},{"name":"PIL","slug":"PIL","permalink":"http://www.liantianhua.com/myblog/tags/PIL/"}]},{"title":"读书会-《为未知而教 为未来而学》","slug":"读书会-《为未知而教-为未来而学》","date":"2018-08-11T13:03:16.000Z","updated":"2018-09-08T13:15:18.430Z","comments":true,"path":"2018/08/11/读书会-《为未知而教-为未来而学》/","link":"","permalink":"http://www.liantianhua.com/myblog/2018/08/11/读书会-《为未知而教-为未来而学》/","excerpt":"书名：《为未知而教，为未来而学》作者：[美]戴维·珀金斯原版名称：《Future Wise: Educating Our Children for a Changing World》","text":"书名：《为未知而教，为未来而学》作者：[美]戴维·珀金斯原版名称：《Future Wise: Educating Our Children for a Changing World》 为什么写这篇文章？这是我2018年第一次更新自己的博客，大学毕业来深圳已有一个月之久，角色正式从校园人转为社会人了。《为未知而教 为未来而学》这本书也是我第一次参加我司读书会活动读到的，想把这次经历记录一下。时间已经过了好几天，关于这本书记忆最深刻的一点—–全局性理解。教育的目标是追求全局性理解，而不是利基理解。 为什么要追求全局性理解？首先从认识我们人类生存的地球开始，地球是一个生态系统，在自然界的一定的空间内，生物与环境构成的统一整体，在这个统一整体中，生物与环境之间相互影响、相互制约，并在一定时期内处于相对稳定的动态平衡状态。每一个环节出现问题，整个系统可能不再平衡，甚至造成系统性的风险。往小的方面来说，我们用的PC或者Mobile都有一个自己的OS（操作系统）。如果说一个操作系统存在Bug，那么这个系统是不稳定的甚至是不安全的。所以存在系统以及系统之上的应用，他们是一个基于操作系统为核心的整体。不管是以上的这些举例，还是我们的生活、学习、工作处处都是一个个的系统性工程，为什么我们不用一种系统性全局性的思想去实践或者操作呢。系统性、全局性的思想以及行事风格是我们大部分人应该去追求的。 全局性理解具备哪些标准？一个东西要想达到全局性理解，必须符合四个方面的标准。第一个是深刻见解方面，对一件事物或者一个东西要从多角度、多方向去了解，有助于我们在生活中对社会经济、政治文化、历史艺术有更多的思考与认识，慢慢理解世界运行的机制及其轨迹。第二个是行动方面，理解意见事情的话要是能够行动实践论证那是再完美不过了。事实上，全局性理解能够正确有力指导我们去采取有效的专业行动，社会行动以及政治行动。第三个是伦理道德方面，全局性理解能够督促帮助为我们变得更有道德观、同情心同时也更加愿意规范我们的行为举止。最后一个是机会方面，全局性理解能够增加我们分辨机会及以及把握机会的能力，机会通常可能会出现在各种不同的场合，表现为各种不同的重要形式。如果这四个方面都具备，这就是一个全局性理解。 具备全局性理解能力的人有哪些优势？拥有全局性理解能力的人，通常情况下会拥以下几个优势。优势一是定向，定向可以帮助我们在认识一件事情的时候把握正确的方向，准确抓住事情的重心及主干，增加做出决定或选择的正确概率。优势二是慎思，全局性理解有利于我们认识一个事物的时候不自觉的从不同方面、不同情况去思考，同样会减少我们失误的概率。优势三是深入学习，拥有全局性理解能力更加有利于我们去进行一个事物的进一步深入学习，有一个全局性、系统性的学习架构及思路会大幅度提高学习的效率及效果。 小结 ◆学习即理解，理解即思考◆学习即运用，把你的理解和思考用起来◆学习即注意，不是“过度联想”而是“未曾联想”◆学习即感兴趣，全局性理解源于发自内心的渴求◆学习即融会贯通，你能用欧姆定律解决供暖管道问题吗","categories":[{"name":"读书","slug":"读书","permalink":"http://www.liantianhua.com/myblog/categories/读书/"}],"tags":[{"name":"学习即理解","slug":"学习即理解","permalink":"http://www.liantianhua.com/myblog/tags/学习即理解/"},{"name":"思维","slug":"思维","permalink":"http://www.liantianhua.com/myblog/tags/思维/"},{"name":"教育","slug":"教育","permalink":"http://www.liantianhua.com/myblog/tags/教育/"}]},{"title":"Face++ Face_Recognition API 的简单使用","slug":"Face-Face-Recognition-API-的简单使用","date":"2017-12-19T07:33:32.000Z","updated":"2017-12-19T08:04:57.000Z","comments":true,"path":"2017/12/19/Face-Face-Recognition-API-的简单使用/","link":"","permalink":"http://www.liantianhua.com/myblog/2017/12/19/Face-Face-Recognition-API-的简单使用/","excerpt":"","text":"Face++ API 地址点击可以查看api文档 ，注册、环境搭建什么的就不说了。 把key、secret换成你自己的就OK啦 1234567891011121314151617181920212223242526272829303132import requestsfrom json import JSONDecoderimport timehttp_url='https://api-cn.faceplusplus.com/facepp/v3/detect'key = \"your key\"secret = \"your secret\"filepath = r\"gaoyuanyuan.jpg\"#API说明二进制文件，需要用 post multipart/form-data 的方式上传data = &#123;\"api_key\": key, \"api_secret\": secret, \"return_landmark\": \"1\" , \"return_attributes\":\"gender,ethnicity,age,smiling,emotion,beauty\"&#125;files = &#123;\"image_file\": open(filepath, \"rb\")&#125;response = requests.post(http_url, data=data ,files=files)req_con = response.content.decode('utf-8')req_dict = JSONDecoder().decode(req_con)print(\"本次请求ID：\" ,req_dict[\"request_id\"])print(\"---------------------------------------------------\")print(\"姓名：高圆圆\")print(\"年龄：\",req_dict[\"faces\"][0][\"attributes\"][\"age\"][\"value\"])print(\"性别：\",req_dict[\"faces\"][0][\"attributes\"][\"gender\"][\"value\"])print(\"人种：\",req_dict[\"faces\"][0][\"attributes\"][\"ethnicity\"][\"value\"])print(\"男性认为的此人脸颜值分数：\",req_dict[\"faces\"][0][\"attributes\"][\"beauty\"][\"male_score\"])print(\"女性认为的此人脸颜值分数：\",req_dict[\"faces\"][0][\"attributes\"][\"beauty\"][\"female_score\"])print(\"面部表情指数：\",req_dict[\"faces\"][0][\"attributes\"][\"emotion\"])#print(req_dict[\"faces\"][0][\"attributes\"]) 1234567891011121314151617181920212223242526272829303132import requestsfrom json import JSONDecoder#API账号相关信息，自己在自己的开发者中心查http_url='https://api-cn.faceplusplus.com/facepp/v3/compare'key = \"your key\"secret = \"your secret\"#需要compare本地图片路径image1 = r\"dahan.jpg\"image2 = r\"minguo.jpg\"#API说明二进制文件，需要用 post multipart/form-data 的方式上传data = &#123;\"api_key\": key, \"api_secret\": secret, \"return_landmark\": \"2\"&#125;files = &#123;\"image_file1\": open(image1, \"rb\"),\"image_file2\": open(image2, \"rb\")&#125;response = requests.post(http_url, data=data, files=files)req_con = response.content.decode('utf-8')req_dict = JSONDecoder().decode(req_con)#输出响应的所有信息#print(req_dict)#输出两张照片的置信度0-100之间，数值越大说明两张脸越像print(\"两张照片的置信度0-100之间，数值越大说明两张脸越像\")print(\"___________________________________________________\")print(\"大韩和民国之间的置信度为：\",req_dict[\"confidence\"]) 你也可以在控制台查看你的使用情况 仅限娱乐，哈哈","categories":[{"name":"API","slug":"API","permalink":"http://www.liantianhua.com/myblog/categories/API/"},{"name":"Face++","slug":"API/Face","permalink":"http://www.liantianhua.com/myblog/categories/API/Face/"},{"name":"人工智能","slug":"API/Face/人工智能","permalink":"http://www.liantianhua.com/myblog/categories/API/Face/人工智能/"}],"tags":[{"name":"python","slug":"python","permalink":"http://www.liantianhua.com/myblog/tags/python/"},{"name":"Face","slug":"Face","permalink":"http://www.liantianhua.com/myblog/tags/Face/"},{"name":"人脸识别","slug":"人脸识别","permalink":"http://www.liantianhua.com/myblog/tags/人脸识别/"}]},{"title":"数据发现世界，阅数据越精彩","slug":"数据发现世界，阅数据越精彩","date":"2017-08-19T07:09:02.000Z","updated":"2017-08-19T09:23:48.000Z","comments":true,"path":"2017/08/19/数据发现世界，阅数据越精彩/","link":"","permalink":"http://www.liantianhua.com/myblog/2017/08/19/数据发现世界，阅数据越精彩/","excerpt":"世界的本质：客观物质存在、主观思想意识、主观思想意识对客观资源现实的支配方法。 在农业时代：由劳动力驱动生产 在工业时代：由机器驱动生产 在信息时代：由数据驱动生产 现在我们的生活中充满百度、阿里 、腾讯三大公司及其系下相关产品的影子，我们可以通过BAT的相关数据指数平台来更好地学习、生活、工作，通过一定的数据分析更好地发现世界理解社会。","text":"世界的本质：客观物质存在、主观思想意识、主观思想意识对客观资源现实的支配方法。 在农业时代：由劳动力驱动生产 在工业时代：由机器驱动生产 在信息时代：由数据驱动生产 现在我们的生活中充满百度、阿里 、腾讯三大公司及其系下相关产品的影子，我们可以通过BAT的相关数据指数平台来更好地学习、生活、工作，通过一定的数据分析更好地发现世界理解社会。 百度指数百度指数是以百度海量网民行为数据为基础的数据分享平台。在这里，你可以研究关键词搜索趋势、洞察网民需求变化、监测媒体舆情趋势、定位数字消费者特征；还可以从行业的角度，分析市场特点。让我们一起探索数据之美，进入百度指数首页。 指数探索 趋势研究 指数概况：提供关键词搜索指数在最近7天和最近30天的平均值，以及其同比、环比变化趋势；可按搜索来源分开查看整体/移动端趋势。指数趋势：根据自定义时间段和自定义地域，查询关键词搜索指数和媒体指数；搜索指数可按搜索来源分开查看整体/移动端趋势，媒体指数不做来源区分。 需求图谱 需求分布：提供中心词搜索需求分布信息，助您了解网民对信息的聚焦点和产品服务的痛点。比如“化妆”的热门需求词包括“方法”、“产品”、“眼妆”等，这说明网民在搜索化妆前后的相关关注主要体现在这些方面。 舆情洞察 新闻监测：根据自定义时间段，查询关键词媒体指数，同时可查看该时段内的TOP10热门新闻。采用新闻标题包含关键词的统计标准，提供新闻原文地址跳转。百度知道：根据自定义时间段，查询关键词相关百度知道热门问题。采用问题标题包含关键词的统计标准，百度知道问题的热门程度由问题浏览量决定。提供百度知道问题原文地址跳转。人群画像地域分布：提供关键词访问人群在各省市的分布。助您了解关键词的地域分布，特定地域用户偏好可进行针对性的运营和推广。人群属性：提供关键词访问人群的性别、年龄分布情况。 品牌表现 数据来源：百度指数专业版 ©baidu作用说明：总体盘点指定行业中所有品牌的搜索热度的变化。算法说明：将指定行业内各个品牌相关检索词汇总并综合计算各品牌汇总词的总体搜索指数及变化率，并以此排名 （注：所有品牌的搜索指数均为基于品牌检索词汇总后的综合搜索指数，与单一检索词搜索指数不可进行比较） 数说专题 基于搜索指数相关数据，按照专题筛选出与某个行业或者话题相关的关键词进行聚类分析，给出更为详细的行业或者话题数据，比如行业搜索趋势、行业细分市场、行业人群属性、该类话题搜索热点等。 我的指数 我收藏的指数 将经常查看的关键词放入“我收藏的指数”，供您随时查看趋势。最多可以收藏50个关键词。我创建的新词可以将百度指数未收录的关键词加入百度指数，加词后第二天系统将更新数据。关键词一经添加，即被视为消费完毕，无法删除或更改。关键词服务到期后，需再次添加。我的购买记录我的购买记录：可以查看创建新词服务购买情况。请您在创建新词权限有效期内新增关键词，过期无效。 下图是百度指数专业版的首页。 阿里指数阿里指数是阿里巴巴出品的基于大数据研究的社会化数据展示平台，媒体、市场研究员以及其他希望了解阿里巴巴大数据的人可以从这里 获取以阿里电商数据为核心的分析报告及相关地区与市场信息。基于阿里大数据，我们面向媒体、机构和社会大众提供地域和行业角度指数化 的数据分析、数字新闻说明、社会热点专题发现，作为市场及行业研究 的参考、社会热点的了解。 阿里指数将分为区域指数、行业指数、数字新闻、专题观察等模块。一期上线模块包括： 区域指数 从地区角度解读交易发展、贸易往来、商品概况、人群特征。通过区域指数，您可以了解一个地方的交易概况，发现它与其他地区之间贸易往来的热度及热门交易类目，找到当地人群关注的商品类目或者关键词，探索交易的人群特征。如果您想探索区域经济，区域指数给您答案！ 行业指数 从行业角度解读交易发展、地区发展、商品概况、人群特征。通过行业指数，您可以了解一个行业的现状，获悉它在特定地区的发展态势，发现热门商品，知晓行业下卖家及买家群体概况。如果您对市场行情充满好奇，不妨来此一探究竟！ 数字新闻 以数字、图表为原料，提供图文并茂的新闻解读，例如通过大数据解读高温天大家都在买什么、做什么。 专题观察 将大家普遍关心的话题以专题报告等形式呈现，例如新年年货、近期热门电影等，提供基于主题的深度数据探索与发现。后续推出这两个模块，敬请期待。 如果您是卖家，建议您通过官方数据产品——面向淘系卖家的生意参谋零售电商版、面向1688卖家的生意参谋1688版获取更多针对店铺及市场相关数据分析。 下图是阿里指数官网首页 腾讯指数腾讯浏览服务（Tencent Browsing Service，以下简称TBS）整合腾讯底层浏览技术和腾讯平台资源及能力，面向应用开发商和广大开发者，提供浏览增强、内容框架、广告体系、H5游戏分发、大数据等服务，已经广泛应用于腾讯庞大的产品体系包括微信，手机QQ，手机QQ空间，手机QQ浏览器等超级应用以及各类垂直应用，日活跃用户超过4亿，日访问PV超过100亿，覆盖中国移动互联网用户80%的页面浏览量。 腾讯浏览指数（Tencent Browsing Index）是依托TBS海量的浏览数据，通过大数据挖掘洞察移动网民的热点，以内容运营人员和市场营销人员为核心受众，辐射娱乐行业人员、媒体及普通用户，帮助用户洞察移动互联热点趋势，了解移动网民浏览行为，构建精准用户行为分析。是企业在新媒体环境下高效洞察用户和塑造品牌的权威平台，是个人做浏览内容选择的高效工具。 垂直榜单 按周更新的垂直榜单（人物榜单按小时更新），覆盖人物、手机、汽车、小说、视频、快消品牌等多个垂直领域，为用户提供最权威、最全面的热点变化。 指数系统 热度趋势 指数概况：关键词在最近特定时间段内热度指数均值，包括浏览相关的自媒体（微信公众号）、传统媒体热度，以及搜索热度。指数曲线： 指定时间段内基于每天热度指数绘制的综合热度曲线图，自媒体、传统媒体、搜索筛选项点击后显示的为对应的细分维度热度曲线。文章发布热度曲线依据每天媒体新发布的文章数绘制而成。热门资讯：依据TBS收录的文章阅读量以及时间范围筛选出来热度最高的TOP10文章列表，帮助用户了解热度波动的原因。资讯列表：综合热度曲线点击后展示单天最热及当天发布的文章列表。 人群画像 地域分布：关键词对应人群在各省份、城市的分布情况。人群属性：关键词对应人群的性别、年龄分布、星座、学历分布情况。 关联浏览 中心位置为关键词，其余为关联词，离中心位置越远表示相关度越低；关联词橙色深浅表示关联词本身的热度指数大小，颜色越深指数越大；上升下降箭头表示关联词热度变化趋势，上升表示关联词本身热度在增加。 大数据专题 根据社会热点及合作方的需求，定制化输出数据报告及用户洞察。 下图是腾讯浏览指数TBI的官网首页 艾瑞指数艾瑞数据、艾瑞指数基于十五年互联网的研究积累，致力于数据改变认知、提升企业效能，为客户提供基于情报+数据+服务的多元化大数据解决方案，服务涵盖市场竞争监测、消费者洞察、营销决策、企业精细化运营及数据共享等业务。 艾瑞APP指数 mUserTracker移动用户行为监测由艾瑞集团自主研发，基于对移动用户行为进行监测所建立的数据库，该数据库由2012年开始，收集用户通过移动设备，对App的使用行为、浏览网站的行为等相关情况。并通过对数据的大量分析建立了多个用户行为指标，真实反映中国移动互联网市场客观情况。 广告公司及广告主帮助广告公司及广告主深入了解智能终端用户的网络行为特征，在其进行移动端营销推广时，提供数据支持，并帮助得出最佳投放方案 移动互联网企业及开发者帮助移动互联网企业及开发者分析自身的产品在整个大行业或细分行业中所处的地位，了解自身的产品用户群体特征以及市场竞争差异 电信及运营商帮助电信及运营商了解用户上网行为，并通过基于流量的分析了解各种应用的使用情况，评估不同运营商的互联网流量经营差异 投资机构帮助投资机构了解移动互联网企业产品运营多维度数据指标，并通过基于用户行为数据分析，高效评估企业价值及市场竞争环境 艾瑞PC指数 iUserTracker网络用户行为监测由艾瑞咨询自主研发，是基于庞大的网民样本行为监测所建立的数据库。该数据库自2006年开始，收集包括用户网络浏览的行为、软件使用行为等详细信息，凭借多年的互联网行业研究经验，通过被监测样本的用户属性标签及多个用户行为竞争分析指标，真实反映中国互联网整体及不同用户市场的客观情况。 互联网公司帮助互联网公司掌握市场第一手资料，洞察竞争媒体的运营及市场地位变化，挖掘用户网络访问习惯改善媒体用户体验。 广告公司及广告主帮助广告公司及广告主了解媒体及目标用户的网络最新动态，在进行媒介资源和营销策略制定时，选出目标用户覆盖最佳媒体投放方案，提升媒介投放效率。 投资机构帮助投资机构了解移动互联网企业产品运营多维度数据指标，并通过基于用户行为数据分析，高效评估企业价值及市场竞争环境。 艾瑞影视指数 iVideoTracker网络视频市场监测由艾瑞咨询自主研发，是基于庞大的网民网络视频收视行为监测所建立的数据库该数据库运营自2011年开始，收集用户对视频内容的浏览行为记录，提供国内主流视频媒体各视频类别视频影片的收视情况及收视人群分布数据，真实反映中国互联网在线视频市场客观情况. 广告公司及广告主分析热点视频的收视周期和收视人群属性规模；分析目标人群的视频内容喜好，视频内容的目标人群覆盖能力；分析各类视频内容的收视人数、收视率及收视时长，为视频广告投放提供决策数据 互联网公司掌握视频内容热点变化，优化对访客视频推荐策略；连续性监测竞争媒体市场份额差异、收视人群变化；挖掘媒体间差异化竞争优势，体现自身媒体市场竞争优势 版权制作方了解用户对不同题材视频的收视偏好，并为版权的发行提供数据监测支持 下图是艾瑞指数官网首页 Google_Trends谷歌趋势又名Google_Trends,主要通过对一段时间内的关键词搜寻量进行统计，得出当下时段的热门内容。Google Trends的用法，可以参考这位博主的文章。 如过大家有任何意见或者想法，欢迎留言交流,谢谢！","categories":[{"name":"数据分析","slug":"数据分析","permalink":"http://www.liantianhua.com/myblog/categories/数据分析/"}],"tags":[{"name":"工具","slug":"工具","permalink":"http://www.liantianhua.com/myblog/tags/工具/"},{"name":"数据分析","slug":"数据分析","permalink":"http://www.liantianhua.com/myblog/tags/数据分析/"},{"name":"指数","slug":"指数","permalink":"http://www.liantianhua.com/myblog/tags/指数/"},{"name":"BAT","slug":"BAT","permalink":"http://www.liantianhua.com/myblog/tags/BAT/"},{"name":"趋势","slug":"趋势","permalink":"http://www.liantianhua.com/myblog/tags/趋势/"}]},{"title":"全球十大搜索引擎，早看早知道","slug":"全球十大搜索引擎，早看早知道","date":"2017-08-14T18:50:26.000Z","updated":"2017-08-14T20:22:55.000Z","comments":true,"path":"2017/08/15/全球十大搜索引擎，早看早知道/","link":"","permalink":"http://www.liantianhua.com/myblog/2017/08/15/全球十大搜索引擎，早看早知道/","excerpt":"在今天的互联网环境下，每当我们遇到不懂的问题，首先想到的就是百度或者Google，但是有时候它们给出的并不是我们想要的答案或者更本搜不到答案，怎么办呢？或许你可以尝试一下下面这些全球有名的搜索引擎，如果你英语不错，用英语搜索效果更佳哦。英语渣渣不敢说话哇……","text":"在今天的互联网环境下，每当我们遇到不懂的问题，首先想到的就是百度或者Google，但是有时候它们给出的并不是我们想要的答案或者更本搜不到答案，怎么办呢？或许你可以尝试一下下面这些全球有名的搜索引擎，如果你英语不错，用英语搜索效果更佳哦。英语渣渣不敢说话哇…… Googlewww.google.com Bingwww.bing.com Yahoosearch.yahoo.com Baiduwww.baidu.com Askwww.ask.com Aolwww.search.aol.com Yandexwww.yandex.com DuckDuckGowww.duckduckgo.com Wolframalphawww.wolframalpha.com Webcrawlerwww.webcrawler.com Ramblernova.rambler.ru/search Sogowww.sogou.com 360www.so.com Infowww.info.com","categories":[{"name":"搜索引擎","slug":"搜索引擎","permalink":"http://www.liantianhua.com/myblog/categories/搜索引擎/"}],"tags":[{"name":"搜索引擎","slug":"搜索引擎","permalink":"http://www.liantianhua.com/myblog/tags/搜索引擎/"},{"name":"web","slug":"web","permalink":"http://www.liantianhua.com/myblog/tags/web/"},{"name":"好奇系列","slug":"好奇系列","permalink":"http://www.liantianhua.com/myblog/tags/好奇系列/"}]},{"title":"从入门到放弃-动手认识Markdown","slug":"从入门到放弃-动手认识Markdown","date":"2017-08-10T21:25:21.000Z","updated":"2017-08-10T22:06:07.000Z","comments":true,"path":"2017/08/11/从入门到放弃-动手认识Markdown/","link":"","permalink":"http://www.liantianhua.com/myblog/2017/08/11/从入门到放弃-动手认识Markdown/","excerpt":"Markdown 是一种轻量级的「标记语言」，它的优点很多，目前也被越来越多的写作爱好者，撰稿者广泛使用，不管你是程序员、文艺小青年、论坛狂热分子，还是经常收发邮件的白领。看到这里请不要被「标记」、「语言」所迷惑，Markdown的语法十分简单。常用的标记符号也不超过十几个，这种相对于更为复杂的HTML标记语言来说，Markdown可谓是十分轻量的，学习成本也不需要太多，且一旦熟悉这种语法规则，会有一劳永逸的效果。从入门到放弃，马上动手认识Markdown语法吧！","text":"Markdown 是一种轻量级的「标记语言」，它的优点很多，目前也被越来越多的写作爱好者，撰稿者广泛使用，不管你是程序员、文艺小青年、论坛狂热分子，还是经常收发邮件的白领。看到这里请不要被「标记」、「语言」所迷惑，Markdown的语法十分简单。常用的标记符号也不超过十几个，这种相对于更为复杂的HTML标记语言来说，Markdown可谓是十分轻量的，学习成本也不需要太多，且一旦熟悉这种语法规则，会有一劳永逸的效果。从入门到放弃，马上动手认识Markdown语法吧！ 概述 Markdown 编辑器工欲善其事，必先利其器。关于编辑器的选择，看大家的眼缘了，可以参考这位博主推荐的编辑器.我用的是chrome的一款插件MaDe,图个方便。 斜体和粗体 分级标题 超链接 锚点在你准备跳转到的指定标题后插入锚点，然后在文档的其它地方写上连接到锚点的链接。 列表无序列表有序列表列表缩进列表项目标记通常是放在最左边，但是其实也可以缩进，最多 3 个空格，项目标记后面则一定要接着至少一个空格或制表符。 引用引用需要在被引用的文本前加上&gt;符号。 代码块引用如果你是个程序猿，需要在文章里优雅的引用代码框，在 Markdown下实现也非常简单。支持代码高亮哦 插入图像 数学公式这个大家自己点进去看吧，看起来有点多，哈哈。 流程图 好像挺多编辑器不支持的哇，等我弄清楚再回来更新，自己点进去看看。 表格 分割线 美化邮件等各种文本输入如果你是用浏览器进行的文本输入，那么基本所有的输入窗口，都可以使用插件，“翻译”你输入的markdown形式的文本。大家有兴趣可以去试试。 注脚","categories":[{"name":"Markdown语法","slug":"Markdown语法","permalink":"http://www.liantianhua.com/myblog/categories/Markdown语法/"}],"tags":[{"name":"Markdown","slug":"Markdown","permalink":"http://www.liantianhua.com/myblog/tags/Markdown/"},{"name":"工具","slug":"工具","permalink":"http://www.liantianhua.com/myblog/tags/工具/"},{"name":"Blog","slug":"Blog","permalink":"http://www.liantianhua.com/myblog/tags/Blog/"}]},{"title":"霸屏App Store的颜值神作续集---纪念碑谷2","slug":"霸屏App-Store的颜值神作续集-纪念碑谷2","date":"2017-08-10T12:39:20.000Z","updated":"2017-08-10T17:25:21.000Z","comments":true,"path":"2017/08/10/霸屏App-Store的颜值神作续集-纪念碑谷2/","link":"","permalink":"http://www.liantianhua.com/myblog/2017/08/10/霸屏App-Store的颜值神作续集-纪念碑谷2/","excerpt":"2014年上线的纪念碑谷，称得上是手游中一个里程碑式的作品。无论是关卡的设置还是画面的美术设计，都如艺术品一般精致。这款唯美几何画风的解密游戏获赞无数，几乎改变了世人对移动游戏的看法和理解。三年之后，纪念碑谷终于有了续篇。在今年的 WWDC 2017上，纪念碑谷悄无声息地出现在 App Store 展示的界面中，随后游戏正式上线 App Store。这款神作的续篇已经霸屏 App Store，上线不到 24 小时已经成为最热门的游戏，在中国区付费游戏排行榜中名列第一。","text":"2014年上线的纪念碑谷，称得上是手游中一个里程碑式的作品。无论是关卡的设置还是画面的美术设计，都如艺术品一般精致。这款唯美几何画风的解密游戏获赞无数，几乎改变了世人对移动游戏的看法和理解。三年之后，纪念碑谷终于有了续篇。在今年的 WWDC 2017上，纪念碑谷悄无声息地出现在 App Store 展示的界面中，随后游戏正式上线 App Store。这款神作的续篇已经霸屏 App Store，上线不到 24 小时已经成为最热门的游戏，在中国区付费游戏排行榜中名列第一。 它不只是一款游戏，更是一种情感载体。神作的续篇引入了全新的剧情，因为距离第一部作品已有三年之久，游戏团队里的一些人也都有了自己的孩子，他们把对亲情的理解映射到新的游戏中。 母女亲情贯穿游戏始终，游戏讲述了母女的相伴、分离、成长再到最后的重逢，在这之中妈妈罗尔和她的女儿将在魔幻建筑中不断揭秘、一起成长，故事由前作的一人冒险，变成了两人的同行。 游戏前期女儿紧紧跟随着自己的妈妈，直到建筑破裂被迫分离。分离之后也隔岸相望，亦步亦趋，之后两人会克服重重困难，再次相逢。然而两人为了远方却又会再次分离，母女之间的温情着实让人感动。 游戏的剧情中有这样一段话： 成长之快，爱意之切 是不安，亦或是喜悦 面对生命的进程 我们不乏勇气 而是放手的决心 游戏中，玩家或多或少会看到曾经的自己，小心翼翼的紧跟父母，在他们身边成长，面对现实又不得不离开他们，最终我们长大，又成为了他们。玩家不仅可以在游戏中体会到母女间的温情故事，还能从中收获自己对生命与成长的感悟。 美妙的视觉享受，一件动态的艺术品游戏画面风格上与前作保持了高度的一致，高耸入云的建筑、黑暗深远的通道、随风飘动的旗条依然延续着前作。齿轮翻转的浑厚之声，四处飘荡的空旷之音也与前作如出一辙。这一看一听就能让你立刻知道，这就是纪念碑谷。 纪念碑谷 2 彰显了作为一件动态的艺术品所展现出来的魅力，清新梦幻的画面色系、各种精妙的视觉搭配以及空灵的音乐瞬间将你带回那个美妙的世界。 即使不玩游戏，只盯着选择关卡界面中的各种动态细节，都能让人感到是一种享受。 更加巧妙的机关设计，全新双主角设定纪念碑谷 2 在关卡设计上保持了极高的制作水平，不合逻辑的设计依然承包了冒险的所有亮点，不可能的结构、悖论，会对你进行各种视觉上的欺骗。 游戏中我们需要对机关进行简单的旋转或者拆分，与前作相比，纪念碑谷 2 中我们可以控制的机关只有一到两个，但每个机关却设计的更加巧妙了，每一步操作都会对整个关卡造成多重的影响。此外，游戏的后期还出现了光影效应、反转扭曲等全新解谜点。新作中采用了全新的双主角设定，让玩家体验角色之间的动态转换。在游戏接近终点的时候，玩家需要同时操作两个角色，才能解开最后的谜题。这种设定让玩家的想象力以及逻辑思维能力又获得更深层次的提高。 小结三年的等待是值得的，纪念碑谷 2 没有让我们失望，无论是巧妙的叙事方式，新颖的游戏玩法，还是既唯美又精致的游戏画面都堪称完美。喜欢这款游戏的小伙伴可以去 App Store 下载，售价为 30 元。 下载地址IOS","categories":[{"name":"手机游戏","slug":"手机游戏","permalink":"http://www.liantianhua.com/myblog/categories/手机游戏/"}],"tags":[{"name":"APP","slug":"APP","permalink":"http://www.liantianhua.com/myblog/tags/APP/"},{"name":"游戏","slug":"游戏","permalink":"http://www.liantianhua.com/myblog/tags/游戏/"},{"name":"颜值担当","slug":"颜值担当","permalink":"http://www.liantianhua.com/myblog/tags/颜值担当/"}]}]}