{"meta":{"title":"卖假货的学长","subtitle":null,"description":"知之不若行之，学至于行而止矣。","author":"LiangTianhua","url":"http://www.liantianhua.com/myblog"},"pages":[{"title":"about","date":"2017-07-29T04:34:50.000Z","updated":"2017-07-29T04:36:11.618Z","comments":true,"path":"about/index.html","permalink":"http://www.liantianhua.com/myblog/about/index.html","excerpt":"","text":""},{"title":"categories","date":"2017-07-29T04:02:46.000Z","updated":"2017-07-29T04:05:41.064Z","comments":true,"path":"categories/index.html","permalink":"http://www.liantianhua.com/myblog/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2017-07-29T04:02:27.000Z","updated":"2017-07-29T04:04:43.780Z","comments":true,"path":"tags/index.html","permalink":"http://www.liantianhua.com/myblog/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"数据发现世界，阅数据越精彩","slug":"数据发现世界，阅数据越精彩","date":"2017-08-19T07:09:02.000Z","updated":"2017-08-19T09:23:48.139Z","comments":true,"path":"2017/08/19/数据发现世界，阅数据越精彩/","link":"","permalink":"http://www.liantianhua.com/myblog/2017/08/19/数据发现世界，阅数据越精彩/","excerpt":"世界的本质：客观物质存在、主观思想意识、主观思想意识对客观资源现实的支配方法。 在农业时代：由劳动力驱动生产 在工业时代：由机器驱动生产 在信息时代：由数据驱动生产 现在我们的生活中充满百度、阿里 、腾讯三大公司及其系下相关产品的影子，我们可以通过BAT的相关数据指数平台来更好地学习、生活、工作，通过一定的数据分析更好地发现世界理解社会。","text":"世界的本质：客观物质存在、主观思想意识、主观思想意识对客观资源现实的支配方法。 在农业时代：由劳动力驱动生产 在工业时代：由机器驱动生产 在信息时代：由数据驱动生产 现在我们的生活中充满百度、阿里 、腾讯三大公司及其系下相关产品的影子，我们可以通过BAT的相关数据指数平台来更好地学习、生活、工作，通过一定的数据分析更好地发现世界理解社会。 百度指数百度指数是以百度海量网民行为数据为基础的数据分享平台。在这里，你可以研究关键词搜索趋势、洞察网民需求变化、监测媒体舆情趋势、定位数字消费者特征；还可以从行业的角度，分析市场特点。让我们一起探索数据之美，进入百度指数首页。 指数探索 趋势研究 指数概况：提供关键词搜索指数在最近7天和最近30天的平均值，以及其同比、环比变化趋势；可按搜索来源分开查看整体/移动端趋势。指数趋势：根据自定义时间段和自定义地域，查询关键词搜索指数和媒体指数；搜索指数可按搜索来源分开查看整体/移动端趋势，媒体指数不做来源区分。 需求图谱 需求分布：提供中心词搜索需求分布信息，助您了解网民对信息的聚焦点和产品服务的痛点。比如“化妆”的热门需求词包括“方法”、“产品”、“眼妆”等，这说明网民在搜索化妆前后的相关关注主要体现在这些方面。 舆情洞察 新闻监测：根据自定义时间段，查询关键词媒体指数，同时可查看该时段内的TOP10热门新闻。采用新闻标题包含关键词的统计标准，提供新闻原文地址跳转。百度知道：根据自定义时间段，查询关键词相关百度知道热门问题。采用问题标题包含关键词的统计标准，百度知道问题的热门程度由问题浏览量决定。提供百度知道问题原文地址跳转。人群画像地域分布：提供关键词访问人群在各省市的分布。助您了解关键词的地域分布，特定地域用户偏好可进行针对性的运营和推广。人群属性：提供关键词访问人群的性别、年龄分布情况。 品牌表现 数据来源：百度指数专业版 ©baidu作用说明：总体盘点指定行业中所有品牌的搜索热度的变化。算法说明：将指定行业内各个品牌相关检索词汇总并综合计算各品牌汇总词的总体搜索指数及变化率，并以此排名 （注：所有品牌的搜索指数均为基于品牌检索词汇总后的综合搜索指数，与单一检索词搜索指数不可进行比较） 数说专题 基于搜索指数相关数据，按照专题筛选出与某个行业或者话题相关的关键词进行聚类分析，给出更为详细的行业或者话题数据，比如行业搜索趋势、行业细分市场、行业人群属性、该类话题搜索热点等。 我的指数 我收藏的指数 将经常查看的关键词放入“我收藏的指数”，供您随时查看趋势。最多可以收藏50个关键词。我创建的新词可以将百度指数未收录的关键词加入百度指数，加词后第二天系统将更新数据。关键词一经添加，即被视为消费完毕，无法删除或更改。关键词服务到期后，需再次添加。我的购买记录我的购买记录：可以查看创建新词服务购买情况。请您在创建新词权限有效期内新增关键词，过期无效。 下图是百度指数专业版的首页。 阿里指数阿里指数是阿里巴巴出品的基于大数据研究的社会化数据展示平台，媒体、市场研究员以及其他希望了解阿里巴巴大数据的人可以从这里 获取以阿里电商数据为核心的分析报告及相关地区与市场信息。基于阿里大数据，我们面向媒体、机构和社会大众提供地域和行业角度指数化 的数据分析、数字新闻说明、社会热点专题发现，作为市场及行业研究 的参考、社会热点的了解。 阿里指数将分为区域指数、行业指数、数字新闻、专题观察等模块。一期上线模块包括： 区域指数 从地区角度解读交易发展、贸易往来、商品概况、人群特征。通过区域指数，您可以了解一个地方的交易概况，发现它与其他地区之间贸易往来的热度及热门交易类目，找到当地人群关注的商品类目或者关键词，探索交易的人群特征。如果您想探索区域经济，区域指数给您答案！ 行业指数 从行业角度解读交易发展、地区发展、商品概况、人群特征。通过行业指数，您可以了解一个行业的现状，获悉它在特定地区的发展态势，发现热门商品，知晓行业下卖家及买家群体概况。如果您对市场行情充满好奇，不妨来此一探究竟！ 数字新闻 以数字、图表为原料，提供图文并茂的新闻解读，例如通过大数据解读高温天大家都在买什么、做什么。 专题观察 将大家普遍关心的话题以专题报告等形式呈现，例如新年年货、近期热门电影等，提供基于主题的深度数据探索与发现。后续推出这两个模块，敬请期待。 如果您是卖家，建议您通过官方数据产品——面向淘系卖家的生意参谋零售电商版、面向1688卖家的生意参谋1688版获取更多针对店铺及市场相关数据分析。 下图是阿里指数官网首页 腾讯指数腾讯浏览服务（Tencent Browsing Service，以下简称TBS）整合腾讯底层浏览技术和腾讯平台资源及能力，面向应用开发商和广大开发者，提供浏览增强、内容框架、广告体系、H5游戏分发、大数据等服务，已经广泛应用于腾讯庞大的产品体系包括微信，手机QQ，手机QQ空间，手机QQ浏览器等超级应用以及各类垂直应用，日活跃用户超过4亿，日访问PV超过100亿，覆盖中国移动互联网用户80%的页面浏览量。 腾讯浏览指数（Tencent Browsing Index）是依托TBS海量的浏览数据，通过大数据挖掘洞察移动网民的热点，以内容运营人员和市场营销人员为核心受众，辐射娱乐行业人员、媒体及普通用户，帮助用户洞察移动互联热点趋势，了解移动网民浏览行为，构建精准用户行为分析。是企业在新媒体环境下高效洞察用户和塑造品牌的权威平台，是个人做浏览内容选择的高效工具。 垂直榜单 按周更新的垂直榜单（人物榜单按小时更新），覆盖人物、手机、汽车、小说、视频、快消品牌等多个垂直领域，为用户提供最权威、最全面的热点变化。 指数系统 热度趋势 指数概况：关键词在最近特定时间段内热度指数均值，包括浏览相关的自媒体（微信公众号）、传统媒体热度，以及搜索热度。指数曲线： 指定时间段内基于每天热度指数绘制的综合热度曲线图，自媒体、传统媒体、搜索筛选项点击后显示的为对应的细分维度热度曲线。文章发布热度曲线依据每天媒体新发布的文章数绘制而成。热门资讯：依据TBS收录的文章阅读量以及时间范围筛选出来热度最高的TOP10文章列表，帮助用户了解热度波动的原因。资讯列表：综合热度曲线点击后展示单天最热及当天发布的文章列表。 人群画像 地域分布：关键词对应人群在各省份、城市的分布情况。人群属性：关键词对应人群的性别、年龄分布、星座、学历分布情况。 关联浏览 中心位置为关键词，其余为关联词，离中心位置越远表示相关度越低；关联词橙色深浅表示关联词本身的热度指数大小，颜色越深指数越大；上升下降箭头表示关联词热度变化趋势，上升表示关联词本身热度在增加。 大数据专题 根据社会热点及合作方的需求，定制化输出数据报告及用户洞察。 下图是腾讯浏览指数TBI的官网首页 艾瑞指数艾瑞数据、艾瑞指数基于十五年互联网的研究积累，致力于数据改变认知、提升企业效能，为客户提供基于情报+数据+服务的多元化大数据解决方案，服务涵盖市场竞争监测、消费者洞察、营销决策、企业精细化运营及数据共享等业务。 艾瑞APP指数 mUserTracker移动用户行为监测由艾瑞集团自主研发，基于对移动用户行为进行监测所建立的数据库，该数据库由2012年开始，收集用户通过移动设备，对App的使用行为、浏览网站的行为等相关情况。并通过对数据的大量分析建立了多个用户行为指标，真实反映中国移动互联网市场客观情况。 广告公司及广告主帮助广告公司及广告主深入了解智能终端用户的网络行为特征，在其进行移动端营销推广时，提供数据支持，并帮助得出最佳投放方案 移动互联网企业及开发者帮助移动互联网企业及开发者分析自身的产品在整个大行业或细分行业中所处的地位，了解自身的产品用户群体特征以及市场竞争差异 电信及运营商帮助电信及运营商了解用户上网行为，并通过基于流量的分析了解各种应用的使用情况，评估不同运营商的互联网流量经营差异 投资机构帮助投资机构了解移动互联网企业产品运营多维度数据指标，并通过基于用户行为数据分析，高效评估企业价值及市场竞争环境 艾瑞PC指数 iUserTracker网络用户行为监测由艾瑞咨询自主研发，是基于庞大的网民样本行为监测所建立的数据库。该数据库自2006年开始，收集包括用户网络浏览的行为、软件使用行为等详细信息，凭借多年的互联网行业研究经验，通过被监测样本的用户属性标签及多个用户行为竞争分析指标，真实反映中国互联网整体及不同用户市场的客观情况。 互联网公司帮助互联网公司掌握市场第一手资料，洞察竞争媒体的运营及市场地位变化，挖掘用户网络访问习惯改善媒体用户体验。 广告公司及广告主帮助广告公司及广告主了解媒体及目标用户的网络最新动态，在进行媒介资源和营销策略制定时，选出目标用户覆盖最佳媒体投放方案，提升媒介投放效率。 投资机构帮助投资机构了解移动互联网企业产品运营多维度数据指标，并通过基于用户行为数据分析，高效评估企业价值及市场竞争环境。 艾瑞影视指数 iVideoTracker网络视频市场监测由艾瑞咨询自主研发，是基于庞大的网民网络视频收视行为监测所建立的数据库该数据库运营自2011年开始，收集用户对视频内容的浏览行为记录，提供国内主流视频媒体各视频类别视频影片的收视情况及收视人群分布数据，真实反映中国互联网在线视频市场客观情况. 广告公司及广告主分析热点视频的收视周期和收视人群属性规模；分析目标人群的视频内容喜好，视频内容的目标人群覆盖能力；分析各类视频内容的收视人数、收视率及收视时长，为视频广告投放提供决策数据 互联网公司掌握视频内容热点变化，优化对访客视频推荐策略；连续性监测竞争媒体市场份额差异、收视人群变化；挖掘媒体间差异化竞争优势，体现自身媒体市场竞争优势 版权制作方了解用户对不同题材视频的收视偏好，并为版权的发行提供数据监测支持 下图是艾瑞指数官网首页 Google_Trends谷歌趋势又名Google_Trends,主要通过对一段时间内的关键词搜寻量进行统计，得出当下时段的热门内容。Google Trends的用法，可以参考这位博主的文章。 如过大家有任何意见或者想法，欢迎留言交流,谢谢！","categories":[{"name":"数据分析","slug":"数据分析","permalink":"http://www.liantianhua.com/myblog/categories/数据分析/"}],"tags":[{"name":"数据分析","slug":"数据分析","permalink":"http://www.liantianhua.com/myblog/tags/数据分析/"},{"name":"指数","slug":"指数","permalink":"http://www.liantianhua.com/myblog/tags/指数/"},{"name":"BAT","slug":"BAT","permalink":"http://www.liantianhua.com/myblog/tags/BAT/"},{"name":"趋势","slug":"趋势","permalink":"http://www.liantianhua.com/myblog/tags/趋势/"},{"name":"工具","slug":"工具","permalink":"http://www.liantianhua.com/myblog/tags/工具/"}]},{"title":"全球十大搜索引擎，早看早知道","slug":"全球十大搜索引擎，早看早知道","date":"2017-08-14T18:50:26.000Z","updated":"2017-08-14T20:22:55.941Z","comments":true,"path":"2017/08/15/全球十大搜索引擎，早看早知道/","link":"","permalink":"http://www.liantianhua.com/myblog/2017/08/15/全球十大搜索引擎，早看早知道/","excerpt":"在今天的互联网环境下，每当我们遇到不懂的问题，首先想到的就是百度或者Google，但是有时候它们给出的并不是我们想要的答案或者更本搜不到答案，怎么办呢？或许你可以尝试一下下面这些全球有名的搜索引擎，如果你英语不错，用英语搜索效果更佳哦。英语渣渣不敢说话哇……","text":"在今天的互联网环境下，每当我们遇到不懂的问题，首先想到的就是百度或者Google，但是有时候它们给出的并不是我们想要的答案或者更本搜不到答案，怎么办呢？或许你可以尝试一下下面这些全球有名的搜索引擎，如果你英语不错，用英语搜索效果更佳哦。英语渣渣不敢说话哇…… Googlewww.google.com Bingwww.bing.com Yahoosearch.yahoo.com Baiduwww.baidu.com Askwww.ask.com Aolwww.search.aol.com Yandexwww.yandex.com DuckDuckGowww.duckduckgo.com Wolframalphawww.wolframalpha.com Webcrawlerwww.webcrawler.com Ramblernova.rambler.ru/search Sogowww.sogou.com 360www.so.com Infowww.info.com","categories":[{"name":"搜索引擎","slug":"搜索引擎","permalink":"http://www.liantianhua.com/myblog/categories/搜索引擎/"}],"tags":[{"name":"搜索引擎","slug":"搜索引擎","permalink":"http://www.liantianhua.com/myblog/tags/搜索引擎/"},{"name":"web","slug":"web","permalink":"http://www.liantianhua.com/myblog/tags/web/"},{"name":"好奇系列","slug":"好奇系列","permalink":"http://www.liantianhua.com/myblog/tags/好奇系列/"}]},{"title":"为什么推荐扇贝阅读？","slug":"为什么推荐扇贝阅读？","date":"2017-08-13T13:13:21.000Z","updated":"2017-08-13T15:57:17.697Z","comments":true,"path":"2017/08/13/为什么推荐扇贝阅读？/","link":"","permalink":"http://www.liantianhua.com/myblog/2017/08/13/为什么推荐扇贝阅读？/","excerpt":"为什么是她？","text":"为什么是她？ 精选每日新闻，用英语看世界。 点击查词，扫清单词障碍。 阅读笔记，帮你看懂英文。 读后感，让你看懂人生。 为什么扇贝阅读能？ 扇贝按照你的词汇量来推荐合适的阅读材料：我们系统的把文章分成不同的难度级别。如果你发现你在阅读的级别对你来说太难或者太简单，你可以相应的选择另一个级别进行阅读。 英语原汁原味：扇贝阅读中的大部分文章，都来自VOA, 路透社等英美主流报刊媒体的最近刊物,涵盖经济，科技，自然科学，体育，娱乐等主题，让你通过英语这扇窗口，更好的了解这个世界，甚至更好的了解中国； 学以致用：对于每篇文章，都会高亮你在扇贝网上学过的单词，让你感受到不断增长的词汇量有用武之地；每篇文章中的生词都即时添加到自己的学习计划中，利用扇贝网强大的记忆系统进行学习；特别的，扇贝阅读可以记录你每天的学习进度，包括完成的文章数，被激活的单词数，将你日积月累的进步通过图表生动的展示； 当然，要培养真正的阅读能力，仅有词汇量是不够的，还需要语法乃至对文化，政经方面背景知识的了解，所以我们不会号称扇贝阅读能够解决所有阅读问题，但它是一个将阅读和词汇学习相结合的强大工具，开始你的原文阅读之旅。 干净清爽的阅读界面干净无广告的阅读界面，是提高阅读体验的重要保证。扇贝阅读提供的点击单词查看详情的小功能，还可以将不懂的word加入你的单词列表，让扇贝阅读更懂你，像小编这种词汇严重缺乏的人来说简直是福音，众里寻他千百度哇。对经常坐地铁，跑步锻炼的小伙伴们来说，扇贝阅读提供了语音阅读功能，带上耳机听也是一个加分项,10分你给不给？ 扇贝读书这个挺好的，书的种类不少，大多数的书的章节都是压缩过的，一般一章节1000单词量左右，像在地铁时间、公交时间、睡前时间都可以驾驭，看自己喜欢了。但是，都是付费的，感觉有点小贵。。啊啊啊啊，花钱买体验吧。 扇贝课程同样的，这一部分的也是付费的功能。有雅思、CET4、CET6的视频课程，如果有需要的可以试试，小编没有钱购买体验，机会留给你们了。 扇贝发现扇贝发现中有自习室板块、扇贝阅读论坛、小组讨论、扇贝商城、扇贝视频、每日一句、精选、小游戏这些次级功能，感觉这些小功能有点花了，你们怎么看？ 总结在扇贝阅读APP中，我最喜欢的是她干净的新闻阅读界面、实时点击翻译&amp;语音播读小功能、扇贝读书，还有可以根据读者的英文水平来推荐也是棒棒的。总的来说，还是非常不错的。看了下扇贝家族的产品线，发现他们的产品的确是有“家族”血统的。在英语阅读的APP中，还有一款叫做“seed”的也是不错（偶然发现的），感兴趣的去看看。","categories":[{"name":"阅读APP","slug":"阅读APP","permalink":"http://www.liantianhua.com/myblog/categories/阅读APP/"}],"tags":[{"name":"APP","slug":"APP","permalink":"http://www.liantianhua.com/myblog/tags/APP/"},{"name":"阅读","slug":"阅读","permalink":"http://www.liantianhua.com/myblog/tags/阅读/"},{"name":"English","slug":"English","permalink":"http://www.liantianhua.com/myblog/tags/English/"}]},{"title":"从入门到放弃-动手认识Markdown","slug":"从入门到放弃-动手认识Markdown","date":"2017-08-10T21:25:21.000Z","updated":"2017-08-10T22:06:07.860Z","comments":true,"path":"2017/08/11/从入门到放弃-动手认识Markdown/","link":"","permalink":"http://www.liantianhua.com/myblog/2017/08/11/从入门到放弃-动手认识Markdown/","excerpt":"Markdown 是一种轻量级的「标记语言」，它的优点很多，目前也被越来越多的写作爱好者，撰稿者广泛使用，不管你是程序员、文艺小青年、论坛狂热分子，还是经常收发邮件的白领。看到这里请不要被「标记」、「语言」所迷惑，Markdown的语法十分简单。常用的标记符号也不超过十几个，这种相对于更为复杂的HTML标记语言来说，Markdown可谓是十分轻量的，学习成本也不需要太多，且一旦熟悉这种语法规则，会有一劳永逸的效果。从入门到放弃，马上动手认识Markdown语法吧！","text":"Markdown 是一种轻量级的「标记语言」，它的优点很多，目前也被越来越多的写作爱好者，撰稿者广泛使用，不管你是程序员、文艺小青年、论坛狂热分子，还是经常收发邮件的白领。看到这里请不要被「标记」、「语言」所迷惑，Markdown的语法十分简单。常用的标记符号也不超过十几个，这种相对于更为复杂的HTML标记语言来说，Markdown可谓是十分轻量的，学习成本也不需要太多，且一旦熟悉这种语法规则，会有一劳永逸的效果。从入门到放弃，马上动手认识Markdown语法吧！ 概述 Markdown 编辑器工欲善其事，必先利其器。关于编辑器的选择，看大家的眼缘了，可以参考这位博主推荐的编辑器.我用的是chrome的一款插件MaDe,图个方便。 斜体和粗体 分级标题 超链接 锚点在你准备跳转到的指定标题后插入锚点，然后在文档的其它地方写上连接到锚点的链接。 列表无序列表有序列表列表缩进列表项目标记通常是放在最左边，但是其实也可以缩进，最多 3 个空格，项目标记后面则一定要接着至少一个空格或制表符。 引用引用需要在被引用的文本前加上&gt;符号。 代码块引用如果你是个程序猿，需要在文章里优雅的引用代码框，在 Markdown下实现也非常简单。支持代码高亮哦 插入图像 数学公式这个大家自己点进去看吧，看起来有点多，哈哈。 流程图 好像挺多编辑器不支持的哇，等我弄清楚再回来更新，自己点进去看看。 表格 分割线 美化邮件等各种文本输入如果你是用浏览器进行的文本输入，那么基本所有的输入窗口，都可以使用插件，“翻译”你输入的markdown形式的文本。大家有兴趣可以去试试。 注脚","categories":[{"name":"Markdown语法","slug":"Markdown语法","permalink":"http://www.liantianhua.com/myblog/categories/Markdown语法/"}],"tags":[{"name":"Markdown","slug":"Markdown","permalink":"http://www.liantianhua.com/myblog/tags/Markdown/"},{"name":"工具","slug":"工具","permalink":"http://www.liantianhua.com/myblog/tags/工具/"},{"name":"Blog","slug":"Blog","permalink":"http://www.liantianhua.com/myblog/tags/Blog/"}]},{"title":"霸屏App Store的颜值神作续集---纪念碑谷2","slug":"霸屏App-Store的颜值神作续集-纪念碑谷2","date":"2017-08-10T12:39:20.000Z","updated":"2017-08-10T17:25:21.640Z","comments":true,"path":"2017/08/10/霸屏App-Store的颜值神作续集-纪念碑谷2/","link":"","permalink":"http://www.liantianhua.com/myblog/2017/08/10/霸屏App-Store的颜值神作续集-纪念碑谷2/","excerpt":"2014年上线的纪念碑谷，称得上是手游中一个里程碑式的作品。无论是关卡的设置还是画面的美术设计，都如艺术品一般精致。这款唯美几何画风的解密游戏获赞无数，几乎改变了世人对移动游戏的看法和理解。三年之后，纪念碑谷终于有了续篇。在今年的 WWDC 2017上，纪念碑谷悄无声息地出现在 App Store 展示的界面中，随后游戏正式上线 App Store。这款神作的续篇已经霸屏 App Store，上线不到 24 小时已经成为最热门的游戏，在中国区付费游戏排行榜中名列第一。","text":"2014年上线的纪念碑谷，称得上是手游中一个里程碑式的作品。无论是关卡的设置还是画面的美术设计，都如艺术品一般精致。这款唯美几何画风的解密游戏获赞无数，几乎改变了世人对移动游戏的看法和理解。三年之后，纪念碑谷终于有了续篇。在今年的 WWDC 2017上，纪念碑谷悄无声息地出现在 App Store 展示的界面中，随后游戏正式上线 App Store。这款神作的续篇已经霸屏 App Store，上线不到 24 小时已经成为最热门的游戏，在中国区付费游戏排行榜中名列第一。 它不只是一款游戏，更是一种情感载体。神作的续篇引入了全新的剧情，因为距离第一部作品已有三年之久，游戏团队里的一些人也都有了自己的孩子，他们把对亲情的理解映射到新的游戏中。 母女亲情贯穿游戏始终，游戏讲述了母女的相伴、分离、成长再到最后的重逢，在这之中妈妈罗尔和她的女儿将在魔幻建筑中不断揭秘、一起成长，故事由前作的一人冒险，变成了两人的同行。 游戏前期女儿紧紧跟随着自己的妈妈，直到建筑破裂被迫分离。分离之后也隔岸相望，亦步亦趋，之后两人会克服重重困难，再次相逢。然而两人为了远方却又会再次分离，母女之间的温情着实让人感动。 游戏的剧情中有这样一段话： 成长之快，爱意之切 是不安，亦或是喜悦 面对生命的进程 我们不乏勇气 而是放手的决心 游戏中，玩家或多或少会看到曾经的自己，小心翼翼的紧跟父母，在他们身边成长，面对现实又不得不离开他们，最终我们长大，又成为了他们。玩家不仅可以在游戏中体会到母女间的温情故事，还能从中收获自己对生命与成长的感悟。 美妙的视觉享受，一件动态的艺术品游戏画面风格上与前作保持了高度的一致，高耸入云的建筑、黑暗深远的通道、随风飘动的旗条依然延续着前作。齿轮翻转的浑厚之声，四处飘荡的空旷之音也与前作如出一辙。这一看一听就能让你立刻知道，这就是纪念碑谷。 纪念碑谷 2 彰显了作为一件动态的艺术品所展现出来的魅力，清新梦幻的画面色系、各种精妙的视觉搭配以及空灵的音乐瞬间将你带回那个美妙的世界。 即使不玩游戏，只盯着选择关卡界面中的各种动态细节，都能让人感到是一种享受。 更加巧妙的机关设计，全新双主角设定纪念碑谷 2 在关卡设计上保持了极高的制作水平，不合逻辑的设计依然承包了冒险的所有亮点，不可能的结构、悖论，会对你进行各种视觉上的欺骗。 游戏中我们需要对机关进行简单的旋转或者拆分，与前作相比，纪念碑谷 2 中我们可以控制的机关只有一到两个，但每个机关却设计的更加巧妙了，每一步操作都会对整个关卡造成多重的影响。此外，游戏的后期还出现了光影效应、反转扭曲等全新解谜点。新作中采用了全新的双主角设定，让玩家体验角色之间的动态转换。在游戏接近终点的时候，玩家需要同时操作两个角色，才能解开最后的谜题。这种设定让玩家的想象力以及逻辑思维能力又获得更深层次的提高。 小结三年的等待是值得的，纪念碑谷 2 没有让我们失望，无论是巧妙的叙事方式，新颖的游戏玩法，还是既唯美又精致的游戏画面都堪称完美。喜欢这款游戏的小伙伴可以去 App Store 下载，售价为 30 元。 下载地址IOS","categories":[{"name":"手机游戏","slug":"手机游戏","permalink":"http://www.liantianhua.com/myblog/categories/手机游戏/"}],"tags":[{"name":"APP","slug":"APP","permalink":"http://www.liantianhua.com/myblog/tags/APP/"},{"name":"游戏","slug":"游戏","permalink":"http://www.liantianhua.com/myblog/tags/游戏/"},{"name":"颜值担当","slug":"颜值担当","permalink":"http://www.liantianhua.com/myblog/tags/颜值担当/"}]},{"title":"Hello World","slug":"hello-world","date":"2017-07-29T03:27:30.718Z","updated":"2017-07-29T03:27:30.721Z","comments":true,"path":"2017/07/29/hello-world/","link":"","permalink":"http://www.liantianhua.com/myblog/2017/07/29/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}